[
  {
    "Title": "[self shouldTest:@”iOS”];",
    "Abstract": "You should test your code. You know you should test your code, and you've seen the benefits. Yet that iOS project you're on seems to be devoid of tests! What's that you say? Mobile testing is impossible? Oh, not impossible, just too hard? Well then, let's have a chat, because Kiwi, the spec-style test framework for iOS is about to blow your mind.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Amber Conville",
    "Technology": "Testing",
    "URI": "/api/sessions.json/self-shouldTestiOS",
    "EventType": "Session",
    "Id": "e5863d98-f8df-4526-91f9-f89af10ba1fe",
    "SessionLookupId": "self-shouldTestiOS",
    "SpeakerURI": "/api/speakers.json/Amber-Conville",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "A humbling experience through web accessibility",
    "Abstract": "“We are sending him on a treasure hunt.” Said Bob, our product analyst, after our accessibility test. “The more cues we can give upfront, the more successful he can navigate around the interface.” \n\nVisually impaired/legally blind folks navigate software in ways most of us, developers, are oblivious to. As a software engineer, watching an accessibility test can humble you pretty quickly. In this session, we will discuss our humbling experience with accessibility at OCLC while working on WorldCat.org and WorldCat for local institutions. We will explore accessibility automation tools and screen readers, discuss best practices to achieve better usability, and uncover accessibility myths and misconceptions. We will also share insight into baking accessibility in the development workflow. Last but not least, developing empathy can only happen when you're in someone’s shoes (experiencing something first/second hand). So, we will work through live demos of accessible/inaccessible apps.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Hany Elemary",
    "Technology": "Design/UX",
    "URI": "/api/sessions.json/A-humbling-experience-through-web-accessibility",
    "EventType": "Session",
    "Id": "4356afd7-95cd-4f83-85bc-2aa3abc627df",
    "SessionLookupId": "A-humbling-experience-through-web-accessibility",
    "SpeakerURI": "/api/speakers.json/Hany-Elemary",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Acceptance Testing: The Dirty Details",
    "Abstract": "Web based acceptance tests are quite valuable, and you should absolutely be writing them. However, there are many different ways that acceptance tests can be written, and choosing the right ones can mean the difference between success and failure for your project. This talk will get into the dirty details of dealing with AJAX, managing test data, keeping tests isolated, and working with your customer or Business Analyst.  The result will be cleaner tests that run faster and are easier to write.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Kevin Berridge",
    "Technology": "Testing",
    "URI": "/api/sessions.json/Acceptance-Testing-The-Dirty-Details",
    "EventType": "Session",
    "Id": "bc9f498b-aed1-476f-971c-187af0dfa650",
    "SessionLookupId": "Acceptance-Testing-The-Dirty-Details",
    "SpeakerURI": "/api/speakers.json/Kevin-Berridge",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Advanced Concurrent Programming in Ruby",
    "Abstract": "Rumor has it that you can't write concurrent programs in Ruby. People once believed that the world was flat and we all know how that turned out. Between the native threads introduced in MRI 1.9 and the JVM threading available to JRuby, Ruby is now a valid platform for concurrent applications. What we've been missing--until now--are the advanced concurrency tools available to other languages like Clojure, Scala, Erlang, and Go. In this session we'll talk about the specific challenges faced when writing concurrent applications; we'll explore modern concurrency techniques such as agents, futures, promises, reactors, and supervisors; and we'll use various open source tools to craft safe, reliable, and efficient concurrent code. We'll write most of our code using the Concurrent Ruby gem but we'll also explore EventMachine and Celluloid.",
    "Difficulty": "Advanced",
    "SpeakerName": "Jerry D'Antonio",
    "Technology": "Ruby / Rails",
    "URI": "/api/sessions.json/Advanced-Concurrent-Programming-in-Ruby",
    "EventType": "Session",
    "Id": "cf1d4540-a679-4c79-8ee4-63958784c713",
    "SessionLookupId": "Advanced-Concurrent-Programming-in-Ruby",
    "SpeakerURI": "/api/speakers.json/Jerry-DAntonio",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "Advanced Topics in Agile Testing--FULL DAY",
    "Abstract": "As Agile becomes more and more mainstream, many teams have gained traction on agile testing principles and practices such as Specification by Example/ ATDD, the Whole-Team approach to testing, and continuous integration. Unfortunately, there are always new problems to solve! \nIn this workshop we’ll address common testing-related problems experienced by more experienced agile testing practitioners, such as managing technical debt, feature acceptance, exploratory testing, working with distributed teams and large systems, continual learning, and improving ROI of automated tests. Lisa Crispin will ask participants to prioritize their most puzzling testing problems. Using impact mapping, groups will work together to come up with experiments for addressing the most daunting impediments.  \nCome with your list of burning issues, and be prepared for fun, interactive learning.",
    "Start": "2014-01-08T13:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Lisa Crispin",
    "Technology": "Other",
    "URI": "/api/sessions.json/Advanced-Topics-in-Agile-TestingFULL-DAY",
    "EventType": "PreCompiler",
    "Id": "b8688755-fa98-43cb-846b-d17e9986b8ab",
    "SessionLookupId": "Advanced-Topics-in-Agile-TestingFULL-DAY",
    "SpeakerURI": "/api/speakers.json/Lisa-Crispin"
  },
  {
    "Title": "An Honest Look at Independence",
    "Abstract": "It’s rare to have a true employer these days – instead developers race to project deadlines, after which their future is up in the air.  A growing number of developers are steering themselves into careers of independent consulting and software development.  \n\nIn an hour session, we will explore my story of independence – the glorious benefits of the freedom and the terrifying responsibility that is all a part of running your own life.  In particular, we’ll see how being independent has almost nothing to do with my work and career and everything to do with my attitude and choices.\n\nThis talk will include: A close look at the financial impact of becoming my own boss; The psychological ups and downs of running my own life; The difficult (and sometimes moronic) choices I’ve been forced to make; Discussion of the legal responsibilities I took on when starting my business; How I get to spend a typical day at the “noffice”.\n\nGoing independent isn’t a panacea to your career woes, it’s a compromise like everything else.  It is a wonderful lifestyle, provided you understand what you’re getting into.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jim Christopher",
    "Technology": "Other",
    "URI": "/api/sessions.json/An-Honest-Look-at-Independence",
    "EventType": "Session",
    "Id": "fe154fcf-69a1-4b53-aab7-48ace4e70965",
    "SessionLookupId": "An-Honest-Look-at-Independence",
    "SpeakerURI": "/api/speakers.json/Jim-Christopher",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Android 4.3 and Bluetooth SMART: The Sensor Games",
    "Abstract": "Looking for an edge in your post-apocalyptic death-match for food?  Until recently, iOS users could make easy use of cheap and versatile sensors that were denied to those of us from District Android… but 4.3 changes that.  Proximity, humidity, temperature, motion, heart rate sensors and more are easy to use, without destroying your precious battery.  Come to this session to learn to use Android to communicate with Bluetooth SMART devices… and avoid becoming another casualty.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Ben Von Handorf",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Android-43-and-Bluetooth-SMART-The-Sensor-Games",
    "EventType": "Session",
    "Id": "ad73d182-f67d-4b3b-ad33-afadaf201734",
    "SessionLookupId": "Android-43-and-Bluetooth-SMART-The-Sensor-Games",
    "SpeakerURI": "/api/speakers.json/Ben-Von-Handorf",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Android Workshop -- HALF DAY",
    "Abstract": "Due to the fast pace of change occurring in the Mobile world, Mobile software development \nis typically very fast paced.  The need to deliver frequent releases often causes developers \nto cut corners and not apply the same rigor to their development activities as they would\notherwise do.  \n\nIn this half day workshop Cheezy will demonstrate how to reverse this pattern.  He will\nlead the participants through the development of an Android application applying\npractices like Test Driven Development and Acceptance Test Driven Development.\nHe will also introduce advanced design concepts that will help keep your Android codebase\nmore flexible and testable.  These practices make it easier to evolve your code to keep\nup with the fast pace of change in the Mobile world.",
    "Start": "2014-01-08T18:30:00Z",
    "End": "2014-01-08T18:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Jeff Morgan",
    "Technology": "Mobile",
    "URI": "/api/sessions.json/Android-Workshop--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "218f5a35-f343-4f9a-a9c2-b0d797d20272",
    "SessionLookupId": "Android-Workshop--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Jeff-Morgan"
  },
  {
    "Title": "Androids Under the Stairs: Mobile Scala",
    "Abstract": "Scala is a sometimes-intimidating programming language that is Object-Oriented, functional, statically typed and wicked badass. It comes batteries-included, featuring a rich collections API, Type inference, and dead-simple concurrency. Perhaps most poignantly though, it's also a 30MB JVM library that can compile to dalvik. Come take a head first dive into crafting an APK with glorious, nutritionally fit Scala. We'll see how we can get more power from less code when wrangling the Android framework to do your bidding. We'll even play with all the basic tools that make this stop seeming like a daunting task and start seeming more like a walk up the stairs.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Nathan Dotz",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Androids-Under-the-Stairs-Mobile-Scala",
    "EventType": "Session",
    "Id": "e3508e50-21a6-4903-9320-334f708eb992",
    "SessionLookupId": "Androids-Under-the-Stairs-Mobile-Scala",
    "SpeakerURI": "/api/speakers.json/Nathan-Dotz",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Angular Directives: Demystified",
    "Abstract": "One of the most powerful yet often misunderstood capabilities of Angular.js is the \"directive\".  Directives allow you to extend the HTML vocabulary by allowing you to describe components or behavior declaratively.  Unfortunately, many people find them magical and difficult to fully understand.  This session will demystify the directive by exploring the subcutaneous layer of Angular.js.  We will cover the directive life-cycle, inherited scope, isolate scope, scope bindings, compilation vs linking, templates and the template cache as well as testing directives.  When we come back to the surface, you will have a clearer understanding of Angular.js and you will be ready to harness the power that Angular.js has to offer.",
    "Difficulty": "Advanced",
    "SpeakerName": "Brian Genisio",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Angular-Directives-Demystified",
    "EventType": "Session",
    "Id": "2c2f1798-dfd9-412b-a519-e0a8a1e6af8c",
    "SessionLookupId": "Angular-Directives-Demystified",
    "SpeakerURI": "/api/speakers.json/Brian-Genisio",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Applied API Design",
    "Abstract": "It's all very well seeing toy examples of API design where only snippets are required, but what does a good API look like in a complete application?\n\nIn this live coding session, Jon will be applying his love of all things immutable, separation of concerns and other design goodness to a certain well-known shape-dropping game. We'll explore different approaches - including ones from the audience - as we go along, but end up with a clean model which works equally well when using WPF, a console-based view... or playing by email. Unlike some other sessions where Jon has shown some truly horrible, unreadable, twisted, evil code the aim here is to end up with an example of elegance and beauty. That doesn't mean we can't visit a few evil notions along the way, of course...",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jon Skeet",
    "Technology": ".NET",
    "URI": "/api/sessions.json/Applied-API-Design",
    "EventType": "Session",
    "Id": "427b2132-0329-4b59-80b0-c360d09b31a6",
    "SessionLookupId": "Applied-API-Design",
    "SpeakerURI": "/api/speakers.json/Jon-Skeet",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Applied Application Security -- HALF DAY",
    "Abstract": "In this four-hour, hands-on class, Bill will give you the tools you need to assess and repair the security of the applications you write.  In a mixture of lecture and exercises, you will learn common developer errors that lead to insecure applications. Topics include Session Management, Injection, Encoding, Information Disclosure and Encryption. Attendees will use penetration testing tools to evaluate the security of a sample web application. When we are done, everyone will know a lot more about building safe, reliable applications on all platforms.",
    "Start": "2014-01-07T17:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Bill Sempf",
    "Technology": "Other",
    "URI": "/api/sessions.json/Applied-Application-Security--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "3dbd4c2d-58c6-4123-a0a3-ef887fe13781",
    "SessionLookupId": "Applied-Application-Security--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Bill-Sempf"
  },
  {
    "Title": "Architecting for the Cloud -- HALF DAY",
    "Abstract": "Cloud development is inherently different than data center development. Understanding those differences, and architecting for them is critical to successful cloud solutions. In this workshop, we will both describe Netflix OSS platform components and show you how you can piece them together to build your own fault-tolerant REST services. These include: Hystrix, Ribbon, Eureka, and Archaius. In this hands-on lab, you will both learn the benefits of each of these services and use them in a sample application (in a test account). If you want to get things running in your own account, you may want to attend the afternoon session (Setting up your environment for the AWS cloud).",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T17:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Sudhir Tonse",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Architecting-for-the-Cloud--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "7415b7da-683b-466f-91a9-c9e26e3e52e2",
    "SessionLookupId": "Architecting-for-the-Cloud--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Sudhir-Tonse"
  },
  {
    "Title": "Are branching, null, and attributes all that OO? Let's get weird!",
    "Abstract": "Although \"being OO\" isn't an end unto itself, we can often learn a great deal about programming by taking things to the extreme.   Branching, null/nil checks, and attributes are not very \"OO\" and are often the source of great complication in our code.  What would our code look like if we did everything we could to avoid them?\n\nIn this talk, we'll create some odd-looking constructs and write some weird code in an attempt to understand just how useful branching, null/nil, and attributes really are.  Do these constructs make our code easier to read and understand, or are they vestiges from older languages like like C, PHP, and Java?",
    "Difficulty": "Intermediate",
    "SpeakerName": "David Copeland",
    "Technology": "Ruby / Rails",
    "URI": "/api/sessions.json/Are-branching-null-and-attributes-all-that-OO-Lets-get-weird",
    "EventType": "Session",
    "Id": "e1040aff-20e1-4b7a-a042-9bbc629a80cb",
    "SessionLookupId": "Are-branching-null-and-attributes-all-that-OO-Lets-get-weird",
    "SpeakerURI": "/api/speakers.json/David-Copeland",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "ASP.NET MVC Workshop -- FULL DAY",
    "Abstract": "In the last few years Microsoft’s Model View Controller (MVC) framework for web development has rapidly grown in popularity amongst traditional ASP.NET “WebForms” developers and developers moving to the Microsoft platform from other technologies.  Unfortunately, for developers new to MVC, getting a good solid foundation on this platform is difficult if they are not familiar with the general concepts and components which make it work.  This workshop provides a rapid introduction to the MVC platform and helps web developers understand the concepts and practices behind MVC.  \n\nWhile starting with the most basic MVC concepts, the workshop will progress through discussions and demonstrations of MVC concepts with the goal of giving all attendees a solid understanding of the platform and all the components and other “moving parts” which make up an MVC application.  All attendees will leave with a handout outline of the content and with recommended resources for further information on everything discussed.  This includes links to training content, sample code, recommended books and blogs, and other information.\n",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Kevin Grossnicklaus",
    "Technology": ".NET",
    "URI": "/api/sessions.json/ASPNET-MVC-Workshop--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "8dc07613-e05a-4578-933a-f721189ab33f",
    "SessionLookupId": "ASPNET-MVC-Workshop--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Kevin-Grossnicklaus"
  },
  {
    "Title": "Async on the Server",
    "Abstract": "Async/await is one of the most celebrated language improvements in modern times, but does it have a place in server-side code? The answer is most definitely \"yes,\" and this talk will explore using async and await on the server.\n\nWe'll start out with an introduction to async and await, with a\nspecial emphasis on the benefits that asynchronous code brings to the server side. In particular, we'll examine how async can help you scale (and situations where it won't!).\n\nNext, we'll cover the basic requirements for using async/await on\nASP.NET and other frameworks. We'll discuss common problems and solutions, and solve some \"pain points\" for async servers.\n\nMost examples will use ASP.NET MVC and WebAPI, but we'll also look at how to use async in Azure worker roles.\n\nAny async/await questions are welcome! Your presenter is the author of the MSDN article \"Best Practices in Asynchronous Programming\" and the top SO answerer for async/await questions.",
    "Difficulty": "Beginner",
    "SpeakerName": "Stephen Cleary",
    "Technology": ".NET",
    "URI": "/api/sessions.json/Async-on-the-Server",
    "EventType": "Session",
    "Id": "1b8f92f0-6293-457b-ae16-ea85247bed61",
    "SessionLookupId": "Async-on-the-Server",
    "SpeakerURI": "/api/speakers.json/Stephen-Cleary",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Automating Windows Applications with Ruby -- HALF DAY",
    "Abstract": "When we think of writing automated tests with ruby and cucumber, Windows desktop applications are not the first thing that come to mind. If you have looked into writing acceptance tests for Windows applications (native, WinForms or WPF), chances are you have come across solutions such as SpecFlow or Raconteur, but what are the options if we want to drive our tests from ruby using cucumber or RSpec?\n\nThis pre-compiler session will take you through building an acceptance test suite using some ruby gems (mohawk, RAutomation and cucumber) that tap into the Microsoft UI Automation accessibility framework to automate native, WinForms and WPF applications.\n\nMore information at https://gist.github.com/leviwilson/5196710",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T17:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Levi Wilson",
    "Technology": "Other",
    "URI": "/api/sessions.json/Automating-Windows-Applications-with-Ruby--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "34827abd-dc35-4e57-865b-29f8d8753f06",
    "SessionLookupId": "Automating-Windows-Applications-with-Ruby--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Levi-Wilson",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Automating Windows Azure without Creating SkyNet",
    "Abstract": "When dealing with systems that must be resilient, self-healing, and highly-available, you can't just flip switches to keep to keep the system online. That plan does not scale, and time would be better spent working on the next set of features. These systems require automation. In this session, we will cover how you can master automation for Windows Azure, including deployment, service provisioning, environment creation, troubleshooting, and more. Examples will include a variety of tools, including PowerShell, the Windows Azure CLI, and the Windows Azure Rest API. Most importantly, we will cover how to incorporate all of these intelligent scripts without inadvertently creating SkyNet.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Mike Wood",
    "Technology": "Other",
    "URI": "/api/sessions.json/Automating-Windows-Azure-without-Creating-SkyNet",
    "EventType": "Session",
    "Id": "8d6fdf0b-4aef-4af2-a9b5-d24ce256545b",
    "SessionLookupId": "Automating-Windows-Azure-without-Creating-SkyNet",
    "SpeakerURI": "/api/speakers.json/Mike-Wood",
    "Start": "2014-01-10T20:35:00Z",
    "End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Becoming an Outlier: Career Reboot for the Developer Mind",
    "Abstract": "As a developer, your image and your mind are your product. So to get what you’ve never had, you must do what you’ve never done with these precious tools. If you want to make a bigger impact, raise your income, and code with purpose, join us. This session is about making a paradigm shift in how you manage your career. We’ll discuss concrete activities and skills that transform average developers into outliers.  You’ll learn why developers can't afford cable, ways to improve your “luck surface area”, and techniques to compress your career through accelerated development.  This session is loosely inspired by Malcolm Gladwell’s “Outliers”, Chad Fowler’s \"The Passionate Programmer\" and Seth Godin's \"Poke the Box\".  Prepare to think about your development career in a whole new way.",
    "Start": "2014-01-10T20:35:00Z",
    "Room": "Rosewood",
    "Difficulty": "Beginner",
    "SpeakerName": "Cory House",
    "Technology": "Other",
    "URI": "/api/sessions.json/Becoming-an-Outlier-Career-Reboot-for-the-Developer-Mind",
    "EventType": "Session",
    "Id": "55965184-f37d-4192-bfaa-3671483f91b3",
    "SessionLookupId": "Becoming-an-Outlier-Career-Reboot-for-the-Developer-Mind",
    "SpeakerURI": "/api/speakers.json/Cory-House",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Beginning Software Craftsmanship -- HALF DAY",
    "Abstract": "In this interactive session, you'll learn some of the basic principles and practices of writing better quality code: testing and pairing.  You'll work with a variety of partners on coding katas designed to instill best practices that you'll then be ready to apply when next you work on production code.  This session is led by the organizers of the Hudson Software Craftsmanship group and provides a great introduction to the afternoon's Intermediate Software Craftsmanship session (though this is not a prerequisite for that session).  Attendees should already be comfortable with a programming language of their choice and if possible should bring along a laptop computer with their development tools installed, including a unit testing tool.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T17:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Brendan Enrick",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Beginning-Software-Craftsmanship--HALF-DAY",
    "EventType": "PreCompiler",
    "SecondarySpeakerName": "Steve Smith",
    "SecondarySpeakerBio": "Steve Smith is an Executive Vice President of Services for Telerik. Telerik Services provides consulting, training, and other services to Telerik’s enterprise clients and partners. Steve is also a Microsoft Regional Director and MVP, as well as a frequent speaker at software developer conferences and events. Steve has (with his wife and partner Michelle) started and sold a number of businesses in his career, including one of the first online developer community websites (ASPAlliance.com), the first Microsoft developer advertising network (Lake Quincy Media), and a successful agile consulting company (NimblePros). Steve has authored several courses for Pluralsight, and has also written or contributed to a number of books, most recently 97 Things Every Programmer Should Know.\n\nIn the past, Steve was an Army Engineer officer and explosives instructor, and he spent some time in Iraq in 2004 leading a combat engineer platoon. Today Steve lives in Kent, Ohio with his wife and their two children.\n\nSteve maintains a blog at Ardalis.com and is active on Twitter as @ardalis. He maintains a professional facebook page at Facebook.com/StevenAndrewSmith.",
    "Id": "7320e76f-ddc9-45b2-b49e-11ced58c3ee2",
    "SessionLookupId": "Beginning-Software-Craftsmanship--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Brendan-Enrick"
  },
  {
    "Title": "Beyond CSS and Color Wheels: Applied UX Design",
    "Abstract": "Design is much broader and more powerful than CSS, Color theory, and grid systems. All that stuff is important, but let's discuss and apply design in the broader sense to up level your next project. This talk will outline some hands on approaches and design techniques or strategies that you can use on your next development project to make better products. Building real products involves an ongoing series of design compromises. How do you make the most of all of these choices? There is no ideal process or magic bullet for integrating design or creating amazing user experiences. However, understanding and applying UX Axioms will allow you to adapt to the situation at hand and build products that resonate with and delight your end-users.",
    "Difficulty": "Beginner",
    "SpeakerName": "Erik Dahl",
    "Technology": "Design/UX",
    "URI": "/api/sessions.json/Beyond-CSS-and-Color-Wheels-Applied-UX-Design",
    "EventType": "Session",
    "Id": "b1b5026b-de23-40b6-adda-3dcacfaff731",
    "SessionLookupId": "Beyond-CSS-and-Color-Wheels-Applied-UX-Design",
    "SpeakerURI": "/api/speakers.json/Erik-Dahl",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Biometrics: Using Your Body for Fun and Profit",
    "Difficulty": "Beginner",
    "SpeakerName": "Chris Gardner",
    "Technology": "Hardware ( Raspberry Pi, Arduino, etc)",
    "URI": "/api/sessions.json/Biometrics-Using-Your-Body-for-Fun-and-Profit",
    "EventType": "Session",
    "Id": "8cd6756b-e02b-4e59-9de2-c5a03098be13",
    "SessionLookupId": "Biometrics-Using-Your-Body-for-Fun-and-Profit",
    "SpeakerURI": "/api/speakers.json/Chris-Gardner",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Building A Mini Killer Robot",
    "Abstract": "Building giant killer robots is hard: permits, nuclear fuel sources, the UN, etc. However, building mini killer robots is much easier thanks to the new LEGO Mindstorms EV3.\n\nIn this talk, we'll look at what LEGO Mindstorms are and what the new EV3 platform is capable of including its servo motors and array of sensors. We'll compare the EV3 platform to the previous NXT 2.0, and talk about why you should immediately go spend all of your money at the Lego store. Then we'll talk about building a robot that can help you take over the world or terrify your pets.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jared Faris",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Building-A-Mini-Killer-Robot",
    "EventType": "Session",
    "Id": "56873927-6e2e-4ddd-86b8-ff27517e45fd",
    "SessionLookupId": "Building-A-Mini-Killer-Robot",
    "SpeakerURI": "/api/speakers.json/Jared-Faris",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Building Apps For Windows",
    "Abstract": "In this one-hour, code-heavy talk, we will explore this new up-and-coming development platform called Windows.  This small startup, Microsoft, has aspirations to compete with the big players, and has a rapidly growing user base hungry for new applications.\n \nWe will look at how to build an application for Windows 8.1 from scratch, and their new mobile platform (aptly named Windows Phone) while using one unified codebase and cloud service to dramatically reduce code repetition.\n \nWe will also look at simple ways to monetize your applications so that you've got the incentive to do it more than once.  You'll leave this talk prepared to build your first apps for Windows and Windows Phone, knowing that an early investment in this wily startup might produce huge dividends if they ever decide to go public.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jeff Blankenburg",
    "Technology": ".NET",
    "URI": "/api/sessions.json/Building-Apps-For-Windows",
    "EventType": "Session",
    "Id": "e65babee-8700-4a4f-860e-e4fc5c0c86eb",
    "SessionLookupId": "Building-Apps-For-Windows",
    "SpeakerURI": "/api/speakers.json/Jeff-Blankenburg",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Building Apps on Windows 8 -- FULL DAY",
    "Abstract": "Forthcoming. Join Jeff Blankenburg for an all day workshop and learn to do something practical, fun, and awesome.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jeff Blankenburg",
    "Technology": ".NET",
    "URI": "/api/sessions.json/Building-Apps-on-Windows-8--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "8407702d-a88d-4dda-992b-47f30bb1a483",
    "SessionLookupId": "Building-Apps-on-Windows-8--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Jeff-Blankenburg"
  },
  {
    "Title": "Building decoupled polyglot applications with Vert.x",
    "Abstract": "Vert.x is an asynchronous application platform built on top of Netty\nthat supports several JVM languages: Clojure, Groovy, Java,\nJavaScript, JRuby, Jython, PHP, and Scala. It uses a multi-reactor\nmodel to efficiently serve a high number of concurrent connections,\nand greatly simplifies distributed component coordination by providing\nbuilt-in message passing between components, up to and including the\nbrowser!\n\nIn this talk, I'll provide an introduction to Vert.x, and cover the\ntrade-offs of using it for developing polyglot applications.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Toby Crawley",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Building-decoupled-polyglot-applications-with-Vertx",
    "EventType": "Session",
    "Id": "8ef6e528-17d2-44a6-83f2-9482a8370d39",
    "SessionLookupId": "Building-decoupled-polyglot-applications-with-Vertx",
    "SpeakerURI": "/api/speakers.json/Toby-Crawley",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Building Killer Single-Page Apps with Durandal and ASP.NET Web API",
    "Abstract": "JavaScript has come into its own as a language for building large, rich applications. Browser improvements have made it lightning-fast and a healthy ecosystem of libraries has risen up around it. Still, building Single-Page applications on your own can be a daunting task. That's where Durandal comes in. It leverages existing libraries like Knockout and RequireJS for data-binding and dependency management, and layers on additional features needed by real-world applications like compositional UI. Come see how Durandal can help you create web applications using state-of-the-art practices and tooling.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Brian Sullivan",
    "Technology": "Windows / .NET",
    "URI": "/api/sessions.json/Building-Killer-SinglePage-Apps-with-Durandal-and-ASPNET-Web-API",
    "EventType": "Session",
    "Id": "3ddc24e6-17c4-4d03-bd1e-7f4ba33dfa94",
    "SessionLookupId": "Building-Killer-SinglePage-Apps-with-Durandal-and-ASPNET-Web-API",
    "SpeakerURI": "/api/speakers.json/Brian-Sullivan",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Building URL-Driven Web Apps with JavaScript",
    "Abstract": "Developers have begun to notice that, using JavaScript, they can build fast, sophisticated UIs that users love. But they have also noticed that tacking more and more JavaScript on top of the traditional architecture of server-rendered HTML has led to unwieldy code that is hard to reason about and extend.\n\nThere is a better way, and it's been sitting under our noses all along. If we begin to think about our web applications as just consumers of an API, like how we build our native and mobile clients, we can achieve better separation of concerns, fewer lines of code, and UIs that we could only previously have dreamt about.\n\nAt the same time, we have to make sure that these 100% JavaScript apps don't break the key feature of the web: the URL. Users rely on the URL to bookmark, share and collaborate, but many JavaScript frameworks treat it like an afterthought.\n\nIn this talk, we'll examine the core architecture needed to build JavaScript applications that don't feel busted, then discuss the specific implementation of those details in Ember.js.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Tom Dale",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Building-URLDriven-Web-Apps-with-JavaScript",
    "EventType": "Session",
    "Id": "61161a18-d25b-4dbd-bc74-45b248a20b65",
    "SessionLookupId": "Building-URLDriven-Web-Apps-with-JavaScript",
    "SpeakerURI": "/api/speakers.json/Tom-Dale",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Building WinPhone Apps -- FULL DAY",
    "Abstract": "Abstract forthcoming. Suffice it to say to say Jeff Blankenburg will show you some amazing stuff.\n\nThis will be a VERY hands on PreCompiler. Don't have hardware? No worries! Some will be available for you to use!",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jeff Blankenburg",
    "Technology": "Mobile",
    "URI": "/api/sessions.json/Building-WinPhone-Apps--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "ef659c84-c9af-4414-bac5-5c6d4b6032a4",
    "SessionLookupId": "Building-WinPhone-Apps--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Jeff-Blankenburg"
  },
  {
    "Title": "Building your own lightsaber - Arduino + Pi + node.js + 3D Printing == build light",
    "Abstract": "Just as every Jedi must construct their own lightsaber, I believe software developers should be able to construct their own build lights. \n\nIn this talk I'll describe my journey into the heart of hardware as I explored the wonderful world of Arduino, Raspberry Pi, electronics, and 3D Printing in an effort to build The Ultimate Build Light. \n\nThere will be blinky things, and possibly the smell of fried components.",
    "Difficulty": "Beginner",
    "SpeakerName": "Pete Hodgson",
    "Technology": "Hardware ( Raspberry Pi, Arduino, etc)",
    "URI": "/api/sessions.json/Building-your-own-lightsaber--Arduino--Pi--nodejs--3D-Printing--build-light",
    "EventType": "Session",
    "Id": "310ed197-2b8a-4246-91a7-2c87cfb37a90",
    "SessionLookupId": "Building-your-own-lightsaber--Arduino--Pi--nodejs--3D-Printing--build-light",
    "SpeakerURI": "/api/speakers.json/Pete-Hodgson",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "C# on a diet with Scriptcs",
    "Abstract": "Have you ever found times where you just want to write and execute some C# code and you ask yourself Do I really need an IDE? a solution? a project? a class? Do I really need to compile? Why do I have to worry about all these dlls? if you've done any development with dynamic languages like Ruby, Python or node.js the answer is you don't. But what about C#? scriptcs (https://github.com/scriptcs/scriptcs) is new way to develop C# applications as script. It leverages compiler advancements of Roslyn and combines the power of nuget to offer a low calorie approach to working with C#. It's great for prototyping, simple scripting or even building simple apps. Not only does it let you write scripted \"apps\", but it also includes a REPL so you can execute code interactively. You can even debug. Come to this talk and it will change the way you think about C# development.",
    "Difficulty": "Beginner",
    "SpeakerName": "Kevin Pilch-Bisson",
    "Technology": ".NET",
    "URI": "/api/sessions.json/C-on-a-diet-with-Scriptcs",
    "EventType": "Session",
    "Id": "73761aa0-b7da-41e6-ac4e-460a60fe7965",
    "SessionLookupId": "C-on-a-diet-with-Scriptcs",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z",
    "SpeakerURI": "/api/speakers.json/Kevin-PilchBisson"

  },
  {
    "Title": "Clojure: Thinking in Data",
    "Abstract": "This is a session that introduces you to the Clojure programming language. Clojure provides a small core set of immutable, persistent data structures. On the other, Clojure uses functional programming to provide a rich set of data manipulation functions. These two pillars of Clojure are fused together through the “sequence” abstraction. Because of sequences, Clojure developers expect that almost any function works with almost any composite data.\n\nThis talk will consider how Clojure’s approach to data differs from object-oriented programming and see how this approach changes the nature of your daily programming. We will also consider topics such as mutation, state vs value, and how to customize your primitive and composite data. You should leave this talk with new ways to think about the intersection of data and function in your program.",
    "Difficulty": "Beginner",
    "SpeakerName": "Alex Miller",
    "Technology": "Languages",
    "URI": "/api/sessions.json/Clojure-Thinking-in-Data",
    "EventType": "Session",
    "Id": "bb2c5cce-6d8b-4dd3-a559-e30badf09212",
    "SessionLookupId": "Clojure-Thinking-in-Data",
    "SpeakerURI": "/api/speakers.json/Alex-Miller",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Communicating with a Fist-full of Wire",
    "Abstract": "This isn't a talk about specific computer hardware. This is a talk about the fundamental concepts that let us move information. What's required? What are the problems to be solved? What goes into being able to transmit even a single bit?\n\nLet's explore the core concepts that allow computers to move information and what barriers there are to that movement. The journey of a GIF image across copper is long, but it starts with a single bit.",
    "Difficulty": "Beginner",
    "SpeakerName": "John Van Enk",
    "Technology": "Hardware ( Raspberry Pi, Arduino, etc)",
    "URI": "/api/sessions.json/Communicating-with-a-Fistfull-of-Wire",
    "EventType": "Session",
    "Id": "716db063-a697-460b-860b-fb6a0144e7a9",
    "SessionLookupId": "Communicating-with-a-Fistfull-of-Wire",
    "SpeakerURI": "/api/speakers.json/John-Van-Enk",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Component-oriented: the past and future of web development",
    "Abstract": "Swing a stick in a crowded room full of web developers. You are almost guaranteed to hit someone who has worked with an MVC framework, and can probably name both a client side and server side example. But MVC, as it's typically defined, is not the only game in town. Component oriented frameworks have been giving developers a more productive and enjoyable way to build web apps for 10 years, and today the approach is gaining serious attention on the client side. Come see what component oriented development looks like, how it lets us work at a better level of abstraction and gives us a better way for designers and developers to work together. We'll also look at how the component oriented paradigm is finding new life on the client in both W3C standards and the most popular client side frameworks of right now.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Chris Nelson",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Componentoriented-the-past-and-future-of-web-development",
    "EventType": "Session",
    "Id": "f71f2486-f200-48a6-b686-c347635697bb",
    "SessionLookupId": "Componentoriented-the-past-and-future-of-web-development",
    "SpeakerURI": "/api/speakers.json/Chris-Nelson",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "Concurrent Applications with F# Agents",
    "Abstract": "To build today's responsive and scalable applications, developers need to start leveraging asynchronous programming methods. During this talk, we'll explore how developers can easily use the F# agent-based programming model, which is based upon the actor concurrency model first made popular in Erlang, to simply and quickly build concurrent applications.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Rachel Reese",
    "Technology": "Windows / .NET",
    "URI": "/api/sessions.json/Concurrent-Applications-with-F-Agents",
    "EventType": "Session",
    "Id": "15234db8-cace-461d-a04d-2fee63a3253e",
    "SessionLookupId": "Concurrent-Applications-with-F-Agents",
    "SpeakerURI": "/api/speakers.json/Rachel-Reese",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Create a Web Site w/ Laravel in Under an Hour",
    "Abstract": "The Laravel framework has quickly mobilized a large and active following. It has invigorated the PHP community by doing so many things right. With a shallow learning curve and its ability to simply get out of the way, it allows developers to focus on functionality and business requirements rather than having to worry about setup and basic application infrastructure.\n\nIn this session I will showcase the features of the Laravel framework by building a web site from scratch in real-tine, complete with registration, mail notifications, a MySQL backend, and Redis for caching. Along the way, the audience will discover the elegance of convention over configuration, dependency management, inversion of control, and all the other goodness Laravel provides.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Dirk Merkel",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Create-a-Web-Site-w-Laravel-in-Under-an-Hour",
    "EventType": "Session",
    "Id": "4c4f8562-a841-447f-aaf6-1d7b546e158c",
    "SessionLookupId": "Create-a-Web-Site-w-Laravel-in-Under-an-Hour",
    "SpeakerURI": "/api/speakers.json/Dirk-Merkel",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Creative Problem Solving - HALF DAY, REPEAT",
    "Abstract": "\"The importance of creative mind in the corporate world cannot be emphasized enough. During this workshop, you will deepen your core skills in collaboration, creativity, empathy, and problem solving. This original workshop will open the door to the hidden creativity potential within you. Building on proven applied improvisational techniques and principles, in a fun and supportive environment, we will show you how to change routine patterns, step outside your comfort zone, and fuel new ideas. We will focus on the following topics: Looking at ideas and issues from multiple perspectives and challenging assumptions Using the applied improvisation principle as a key to a successful teamwork Learning how to shift in the moment and be flexible with your agenda\n Stepping outside your comfort zone in a trusting environment \nThinking on the spot\n Tapping into your creative side \nBuilding active listening skills\"",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T17:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Jessie Shternshus",
    "Technology": "Soft Skills",
    "URI": "/api/sessions.json/Creative-Problem-Solving--HALF-DAY-REPEAT",
    "EventType": "PreCompiler",
    "Id": "95600576-7819-4bcb-b077-9b99401098d3",
    "SessionLookupId": "Creative-Problem-Solving--HALF-DAY-REPEAT",
    "SpeakerURI": "/api/speakers.json/Jessie-Shternshus"
  },
  {
    "Title": "Creative Problem Solving -- HALF DAY, REPEATS",
    "Abstract": "The importance of creative mind in the corporate world cannot be emphasized enough. During this workshop, you will deepen your core skills in collaboration, creativity, empathy, and problem solving. This original workshop will open the door to the hidden creativity potential within you. Building on proven applied improvisational techniques and principles, in a fun and supportive environment, we will show you how to change routine patterns, step outside your comfort zone, and fuel new ideas. We will focus on the following topics: Looking at ideas and issues from multiple perspectives and challenging assumptions Using the applied improvisation principle as a key to a successful teamwork Learning how to shift in the moment and be flexible with your agenda\n Stepping outside your comfort zone in a trusting environment \nThinking on the spot\n Tapping into your creative side \nBuilding active listening skills",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T17:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Jessie Shternshus",
    "Technology": "Soft Skills",
    "URI": "/api/sessions.json/Creative-Problem-Solving--HALF-DAY-REPEATS",
    "EventType": "PreCompiler",
    "Id": "86e6cfa4-9c1d-41c3-80a3-28acd09d478e",
    "SessionLookupId": "Creative-Problem-Solving--HALF-DAY-REPEATS",
    "SpeakerURI": "/api/speakers.json/Jessie-Shternshus"
  },
  {
    "Title": "D3.js as client-side web framework",
    "Abstract": "Today, more and more of the work of generating a web page is happening on the client side. Web developers are creating in-browser templates and frameworks to help build these pages. Most of them look a lot like the server-side systems of old - HTML sprinkled with *place content here*. But what if there was a better way?\n\nD3 was created for data visualization - usually by creating SVG elements in the browser. The way it achieves this is by transforming data into a DOM. It has a declarative style that reduces the mental load on the programmer. By tying the data directly to its representation it enables transitions with little or no extra logic.\n\nHTML is not the goal of our template systems - the goal is a browser “document”. When our code lived on the server, HTML was the natural intermediate representation. But now that we are writing our software to run in the browser itself, we no longer need this middle-man.\n\nIn my talk I plan to explore client-side, data-driven page creation without templates by applying D3. I think this approach has great prospects for enabling more expressive client-side web development.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Neal Lindsay",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/D3js-as-clientside-web-framework",
    "EventType": "Session",
    "Id": "c0b706cc-763e-4fd6-9841-f785fc863982",
    "SessionLookupId": "D3js-as-clientside-web-framework",
    "SpeakerURI": "/api/speakers.json/Neal-Lindsay",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Data Modeling Examples from the Real World -- HALF DAY",
    "Abstract": "In this session, we'll examine schema design insights and trade-offs using real world examples. We'll look at three example applications: building an email inbox, selecting a shard key for a large scale web application, and using MongoDB to store user profiles. From these examples you should leave the session with an idea of the advantages and disadvantages of various approaches to modeling your data in MongoDB. Attendees should be well versed in basic schema design.",
    "Start": "2014-01-08T17:30:00Z",
    "Difficulty": "Advanced",
    "SpeakerName": "Mike Friedman",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Data-Modeling-Examples-from-the-Real-World--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "5d4f3b38-fc64-40e8-9005-8f94bbd7ed08",
    "SessionLookupId": "Data-Modeling-Examples-from-the-Real-World--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Mike-Friedman"
  },
  {
    "Title": "Debugging with Fiddler",
    "Abstract": "Fiddler is the world’s most popular web debugging tool, used by developers, testers, and other web technologists worldwide. In this talk, I’ll show how to fully exploit Fiddler to debug traffic from client applications, devices, and web services. We’ll cover the latest enhancements to Fiddler to enable debugging on Windows 8’s new application platform, and how to debug mobile applications running on non-Windows platforms. We’ll look at Fiddler’s new support for HTML5 WebSockets, and explore how Fiddler can be combined with other tools and technologies to enable comprehensive testing of sites and applications. We’ll go beyond passive traffic monitoring to show how Fiddler can be used to modify and even generate web traffic to simulate clients or servers not yet built. We’ll end with an exploration of existing extensions that greatly expand Fiddler’s power, and how developers can easily extend Fiddler to meet their own specific needs.\n\n(Session similar to that presented at CodeCamp2013/DevReach 2013 conference, with new material)",
    "Difficulty": "Intermediate",
    "SpeakerName": "Eric Lawrence",
    "Technology": "Testing",
    "URI": "/api/sessions.json/Debugging-with-Fiddler",
    "EventType": "Session",
    "Id": "20279d93-0a7c-4cbf-a2f8-91d2a1348bd1",
    "SessionLookupId": "Debugging-with-Fiddler",
    "SpeakerURI": "/api/speakers.json/Eric-Lawrence",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Democratizing Event-Processing at all Scales in all Languages",
    "Abstract": "In today’s world of connected cloud-centric applications with rich user experiences, the need for asynchronous and event programming is bigger than ever. No language is an exception to the rule.  With the C# and Visual Basic language features added to .NET 4.5, an imperative approach to sequential composition and orchestration of asynchronous operations has been introduced. Come and learn how the Reactive Extensions (Rx) complement this feature set, adding the notion of multi-value asynchronous observable sequences with full-fledged LINQ support.  With JavaScript, you will learn about how it works with the world of callbacks, events, and Promises.\n\nIn this demo-intensive session, we will sketch out the asynchronous and event programming landscape, and dive into the unique role played by Rx. After explaining the design philosophy of Rx, rooted in the deep duality between enumerable and observable sequences, we will cover the rich set of query operators that enable complex event processing. And we'll show off examples of using Rx on each platform and for use cases from user interface with XAML or HTML, to server side complex event processing and asynchronous programming.\n\nDemocratizing asynchronous and event processing starts today!",
    "Difficulty": "Intermediate",
    "SpeakerName": "Matthew Podwysocki",
    "Technology": "Languages",
    "URI": "/api/sessions.json/Democratizing-EventProcessing-at-all-Scales-in-all-Languages",
    "EventType": "Session",
    "Id": "49b40c9f-3107-4f12-b8ae-1043db96e594",
    "SessionLookupId": "Democratizing-EventProcessing-at-all-Scales-in-all-Languages",
    "SpeakerURI": "/api/speakers.json/Matthew-Podwysocki",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Demystify the Modern Identity Stack",
    "Abstract": "Should I trust you? Who is this really? How do I know you are who you say you are? Identity is an Authentication conversation that needs to happen, and the tools and services available today make it easy to implement. From OAuth to ACS to Membership Providers the tools are available, but what should you use? Access Control Services provides a great way to leverage existing identity in the Cloud, integrating 3rd party identity with OAuth and the new Simple Membership Provider is fast and relatively easy to configure, but the choices you make need to be made in the right context. In this session we dive into the options available for working with identity, how they work, and what you need to know to be able to implement it in your solutions. From creating and configuring the services to putting them to work in your application we will explore the tools, the code and the tips for making it work the way it was meant to.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Mike Benkovich",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Demystify-the-Modern-Identity-Stack",
    "EventType": "Session",
    "Id": "c6389657-d346-4609-9a06-b1b1b0ae3416",
    "SessionLookupId": "Demystify-the-Modern-Identity-Stack",
    "SpeakerURI": "/api/speakers.json/Mike-Benkovich",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Developing with Cordova (PhoneGap) -- HALF DAY",
    "Abstract": "In this session, we will discuss the Cordova framework. Cordova lets you\nuse web standards to create mobile applications for multiple different\nplatforms. We will walk through the setup process and discuss development\ntechniques as well as methods of testing. As a group, we will build a few\nsample applications to examine some of Cordova's feature set. PhoneGap\nBuild will also be demonstrated and explained.",
    "Start": "2014-01-07T18:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Ray Camden",
    "Technology": "Mobile",
    "URI": "/api/sessions.json/Developing-with-Cordova-PhoneGap--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "7477d00b-1cd5-415c-83b2-3d5142de2ce9",
    "SessionLookupId": "Developing-with-Cordova-PhoneGap--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Ray-Camden"
  },
  {
    "Title": "Devs who grok testing: Why I love working with them, and how they mitigate risk",
    "Abstract": "We hear a lot (especially in the testing community) about how there are so many programmers who barely understand testing. But some of us testers have had the good fortune to work with developers who value testing and enjoy testing activities. We testers love working with devs who \"get\" testing. In this session, we'll look at how the techniques test-obsessed developers use mitigate business risk. We'll explore ways testers and coders can collaborate better and spread around the testing joy. \n\nThis will be a participatory session, hopefully generating some new techniques for managing risk through a whole-team approach to testing.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Lisa Crispin",
    "Technology": "Testing",
    "URI": "/api/sessions.json/Devs-who-grok-testing-Why-I-love-working-with-them-and-how-they-mitigate-risk",
    "EventType": "Session",
    "Id": "24fb9877-cdba-46f7-bae1-b7f558ea0d67",
    "SessionLookupId": "Devs-who-grok-testing-Why-I-love-working-with-them-and-how-they-mitigate-risk",
    "SpeakerURI": "/api/speakers.json/Lisa-Crispin",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Do Some \"Solr\"Searching With Your Apps",
    "Abstract": "You've designed your application, built it up, and it's working great.  One of the last features to implement is searching and reporting.  You think you can get away with just implementing some SQL LIKE statements for an initial search, but you need to search across many fields or perform complexed grouped searches (like in Amazon that shows search counts by subcategory).  You've put it off because you really don't want to deal with SQL Server Full-Text Indexing - maybe it's not your cup of tea or maybe it's just intimidating or maybe you're not using something other than SQL Server.  But there are alternatives to Full-Text Indexing that can be just as powerful and fairly simple.  Solr is one such open source tool to help you with your application's searching needs.  We'll take a look at the Solr project, how you can get it up and running very easily, how you can install it as a Windows Service (as opposed to a command window), and how you can use program against it RESTfully and using Solrnet.  We'll look at basic searches along with some cool features like faceting, highlighting and rankings. If time permits, we can also look at how Solr can also complement a NoSQL environment.  You won't believe how easy incorporating Solr into your application can be!",
    "Difficulty": "Intermediate",
    "SpeakerName": "David Hoerster",
    "Technology": "Windows / .NET",
    "URI": "/api/sessions.json/Do-Some-SolrSearching-With-Your-Apps",
    "EventType": "Session",
    "Id": "f7e503c4-a960-48f6-9438-803cff6ba829",
    "SessionLookupId": "Do-Some-SolrSearching-With-Your-Apps",
    "SpeakerURI": "/api/speakers.json/David-Hoerster",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Don't forget to throw out the trash!",
    "Abstract": "JavaScript is, arguably, the most used language on the internet. No matter what language the server side is written in, JavaScript is generally prevalent on the client to enhance and, sometimes, control the user's experience. But how much do you look into the memory consumption and garbage collection of your JavaScript objects?\n\nIn this session, we will start by looking at how the JavaScript garbage collection functionality works in Firefox, Chrome and IE. Next, we'll cover the ways memory leaks can occur within your website. And we'll close out the session with ways you can write code to ensure a leak does not occur.",
    "Difficulty": "Intermediate",
    "SpeakerName": "George Walters II",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Dont-forget-to-throw-out-the-trash",
    "EventType": "Session",
    "Id": "ca61e245-4968-4b6e-8333-a37606444181",
    "SessionLookupId": "Dont-forget-to-throw-out-the-trash",
    "SpeakerURI": "/api/speakers.json/George-Walters-II",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "DudeOps: Why the Big Lebowski is about your IT Project",
    "Abstract": "In this off colored talk, I'll cover the major players of cult favorite The Big Lebowski and how those players map to the people you are likely to encounter when executing an IT project. Successful IT projects are often more about the organizational issues you'll encounter rather than the technical issues. In this talk, we'll cover some of the \"characters\" of IT you will encounter on your journey, and how to overcome them. For fun, we will draw from the characters of The Big Lebowski, as well as the Dude's experiences, in order to help you navigate your organization.\n\nAfter all, \"All the Dude ever wanted was his project done.\"\n\nI've given this talk before, you can see the video here:\nhttp://www.youtube.com/watch?v=RUhUKBQKXNM\n\nIt is a ton of fun and well received by the audience.",
    "Difficulty": "Beginner",
    "SpeakerName": "Michael Ducy",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/DudeOps-Why-the-Big-Lebowski-is-about-your-IT-Project",
    "EventType": "Session",
    "Id": "e75f11c3-47c9-4a21-bede-3a26f8a945bf",
    "SessionLookupId": "DudeOps-Why-the-Big-Lebowski-is-about-your-IT-Project",
    "SpeakerURI": "/api/speakers.json/Michael-Ducy",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Electronics, Arduino and Pi, Oh My! -- FULL DAY",
    "Abstract": "This precompiler will be presented in two halves so attendees can feel free to join in where they feel most comfortable.\n\nGet a start in the Hacker/Maker movement and join us for a day of creating. The morning session will be an introduction to simple electronics and digital circuits. We will cover things like power, ohms law, LEDs, resistors, transistors, capacitors and more to start your journey with digital circuits. During this 4 hour session, we will provide instructions and help in building some simple circuits with a breadboard to create a simple “traffic light” or “flashing lights”.\n\nThe afternoon session will build on what we covered in the morning session and integrate the electronic components we learned about into a computer controlled project. We will cover the development environments of Arduino, Netduino and Raspberry Pi devices and cover basic control of various circuits. We will have “tutorial” projects for you to work through to build a working model in this 4 hour session.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Brian Sherwin",
    "Technology": "Hardware ( Raspberry Pi, Arduino, etc)",
    "URI": "/api/sessions.json/Electronics-Arduino-and-Pi-Oh-My--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "979079b6-f9c7-435e-8141-1a54aaec53ab",
    "SessionLookupId": "Electronics-Arduino-and-Pi-Oh-My--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Brian-Sherwin"
  },
  {
    "Title": "Embedding JavaScript in .NET",
    "Abstract": "Having a scripting engine embedded in an application can make them so much more expressive and valuable. In .NET, there several choices for scripting languages: C#, Visual Basic, Python, PowerShell, etc. But what about JavaScript? Why is the dominant language on the Internet missing from the lineup? In this session, we'll address that question by implementing a JavaScript rules engine within a .NET application using two very different approaches. After attending this session, you will understand the security implications, the benefits of integration and the performance costs of each approach. Moreover, you will be ready to decide whether an embedded JavaScript engine makes sense for your own .NET applications.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Kevin Hazzard",
    "Technology": "Windows / .NET",
    "URI": "/api/sessions.json/Embedding-JavaScript-in-NET",
    "EventType": "Session",
    "Id": "a41687a5-c783-4f91-bb88-123a2080417c",
    "SessionLookupId": "Embedding-JavaScript-in-NET",
    "SpeakerURI": "/api/speakers.json/Kevin-Hazzard",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Embrace the IFrame",
    "Abstract": "IFrame shouldn’t be a bad word. Most people think of iframes as a last resort and only view them as a good way to embed youtube videos or third party applications. In this talk, you will learn that iframes have a place in your applications and they are a valuable tool in your toolbox. We'll look at how to use iframes as a powerful tool to facilitate cross domain communication, perform app-cache magic, secure content, sandbox javascript and more. This talk will show you a number of helpful ways to script iframes and use their powers for good.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Daniel Shultz",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Embrace-the-IFrame",
    "EventType": "Session",
    "Id": "21a3cd6f-1479-43f9-ac62-4a168c23a128",
    "SessionLookupId": "Embrace-the-IFrame",
    "SpeakerURI": "/api/speakers.json/Daniel-Shultz",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Engineering Beauty",
    "Abstract": "Armed with a laptop and an idea, today's developer can build remarkable products with relative ease. If we have a coding problem, we simply do a Google search or post a question on Stack Overflow for help. One subject that is not so easy for developers to learn is design.\n\nWe can write the most pristine code, but if our product is poorly designed, all is for not. The resources for design are simply too hard to find. There are many reasons for this, but mainly can be attributed to the difficulty of articulating the design process through which designers make decisions.\n\nThe truth is, there is in fact a process and framework for good web design. In this talk, I will cover some of the common pitfalls developers fall into and a few basic design principles from a developer's perspective. I will show how we can apply what we already know about programming to design. You'll gain a new appreciation for the invisible forces that guide good design decisions day-to-day. Your designer colleagues will be happier and most importantly your customers will be happier.",
    "Difficulty": "Beginner",
    "SpeakerName": "Matt Sears",
    "Technology": "Design/UX",
    "URI": "/api/sessions.json/Engineering-Beauty",
    "EventType": "Session",
    "Id": "d66b40ab-c1df-4fca-8dc0-b6a4b0be85d1",
    "SessionLookupId": "Engineering-Beauty",
    "SpeakerURI": "/api/speakers.json/Matt-Sears",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "Escaping Reality With Shoes",
    "Abstract": "Let's imagine for a moment, you have the day off and all of your friends are out of town.. and it's raining!\n\nWhat are you going to do with all of that free time?\n\nThere are so many options, and one of my personal favorites is hacking on some random idea or experiementing with code.\n\nIt's important to step out of your comfort zone, and in this talk we will go one step further into the Magical Land of Shoes.\n\nLet's catch up on the last few years of the project, the future, and all of the amazing things you can build with it. Yours truly will give you a whirlwind tour of what Shoes is capable of and together build an experience that we can share for a lifetime.",
    "Difficulty": "Beginner",
    "SpeakerName": "Zachary Scott",
    "Technology": "Ruby / Rails",
    "URI": "/api/sessions.json/Escaping-Reality-With-Shoes",
    "EventType": "Session",
    "Id": "f4140e26-1f76-4993-9bd3-01e577cb4fdd",
    "SessionLookupId": "Escaping-Reality-With-Shoes",
    "SpeakerURI": "/api/speakers.json/Zachary-Scott",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Exploring JVM Bytecodes",
    "Abstract": "Have you wondered what happens to your Java, Scala, JRuby, or Groovy code when it compiles?  Have you decompiled a class file to see what is going on? Have you wondered which is more efficient to code? loops or switches? one way vs. another? This presentation will answer those questions. It will provide an overview of the .class file format, discuss the JVM instruction set, and explore differences in the compiled bytecodes caused by minor changes in source code.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Matt Insko",
    "Technology": "Java",
    "URI": "/api/sessions.json/Exploring-JVM-Bytecodes",
    "EventType": "Session",
    "Id": "0abb10d0-1673-4e2e-97b1-61a019e11754",
    "SessionLookupId": "Exploring-JVM-Bytecodes",
    "SpeakerURI": "/api/speakers.json/Matt-Insko",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Feeling Confident About Your Legacy Code",
    "Abstract": "It's probably a safe assumption that we've all worked on applications which we didn't initially build and we've all been hesitant to make changes to those applications because we're unsure about what our change will affect. Michael Feathers considers legacy code any code without a test, and in this case, he's right. But how do you deal with legacy code in order to make you feel confident that it's testable and that your changes will not affect other parts of the application? It's a tough task, but this talk will show some practices and techniques to make you more confident with your experiences with working on legacy code. We'll look at injection patterns, how to take advantage of mocking, and how to apply some simple design enhancements to your code to make it more testable.",
    "Difficulty": "Intermediate",
    "SpeakerName": "David Hoerster",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Feeling-Confident-About-Your-Legacy-Code",
    "EventType": "Session",
    "Id": "6c5a5827-bbf5-4da1-8451-a67b148e1056",
    "SessionLookupId": "Feeling-Confident-About-Your-Legacy-Code",
    "SpeakerURI": "/api/speakers.json/David-Hoerster",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "Fixing the JavaScript Mess -- HALF DAY",
    "Abstract": "JavaScript has started to get some real respect over the last few years. Developers are treating it like a real language and modern frameworks (like Knockout, Backbone, Angular, etc) are making it easier to write good code. However, many of us are working on legacy applications with lots of nasty JavaScript bits: server generated JS controls connected to downloaded plugins with a bit of jQuery glue.\n\nIn this workshop, we'll analyze an example application that uses a lot of these anti-patterns. We'll pick apart the pieces and rebuild the application using JavaScript best practices, modern frameworks, and other useful libraries. We'll talk about how to decide on what tools to use for new projects as well as legacy revamps. We'll also look into how you can improve parts of your application without having to rewrite other ones that are working just fine.\n\nYou'll leave this workshop with a better appreciation of good JavaScript patterns, and the tools necessary to write cleaner client-side code.",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T17:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jared Faris",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Fixing-the-JavaScript-Mess--HALF-DAY",
    "EventType": "PreCompiler",
    "SecondarySpeakerName": "Jeremy Fensch ",
    "SecondarySpeakerBio": "Jeremy is a Consultant with the Microsoft Practice at HMB, based out of Columbus, OH. For the past several years he has been building things for the web, and along the way done his part to obliterate hideous code. He loves chasing down new tools, techniques, and patterns to make better code accessible to his team.  Whenever he is not learning, pondering, or writing code he can usually be found sharing something new with whoever will listen. You can follow him on Twitter @jfensch",
    "Id": "16ae3543-53c3-47d3-aa7a-261f9b9864e1",
    "SessionLookupId": "Fixing-the-JavaScript-Mess--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Jared-Faris"
  },
  {
    "Title": "Flying Robot Hack Day -- FULL DAY",
    "Abstract": "Come and hack on flying robots.  Work in a 3 person team and develop some software to control a Parrot AR Drone flying quadcopter.  Make the drone fly in circles, flip over, or dance to the commands of your program.  Or use the camera data to track targets, do facial recognition or follow a laser pointer. The only limit is your imagination.\n\nYou can write your software in Javascript (http://nodecopter.com/hack), Ruby (https://github.com/jimweirich/argus), Clojure (https://github.com/gigasquid/clj-drone), or any language of your choice.\n\nThis is an all day workshop.  At the end of the day we will have a demonstration time for everyone to show off their dancing drones.",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jim Weirich",
    "Technology": "Hardware ( Raspberry Pi, Arduino, etc)",
    "URI": "/api/sessions.json/Flying-Robot-Hack-Day--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "384ee0ee-7f9f-4236-adc0-5325b4c05505",
    "SessionLookupId": "Flying-Robot-Hack-Day--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Jim-Weirich"
  },
  {
    "Title": "Following the changing weather of the clouds.",
    "Abstract": "Using metrics and monitoring is one way to detect changes in Netflix's EC2 cloud, but we found that a new system that automatically told us about changes in our environment was a really minor investment that paid huge dividends.  It reduced the bureaucracy around production changes to almost zero and sped up our time to resolve issues dramatically.  In this session I'll cover what motivated us to write it, the ideas behind the design, and actually walk through the code itself and the underlying database design to show it's relative simplicity.  You will leave this session with ideas about how you, too, can reduce bureaucracy and friction in your organization.\n\nNote:  By the time the talk is given, the software will most likely be open source and available for attendees to download and follow along.",
    "Difficulty": "Intermediate",
    "SpeakerName": "JEREMY EDBERG",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Following-the-changing-weather-of-the-clouds",
    "EventType": "Session",
    "Id": "9c42419f-fda0-4004-b79f-38fe43fcf747",
    "SessionLookupId": "Following-the-changing-weather-of-the-clouds",
    "SpeakerURI": "/api/speakers.json/JEREMY-EDBERG",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "Functional Test Automation Smackdown",
    "Abstract": "I, Jeff Morgan (AKA Cheezy), and one other test automation geek yet to be determined, will take the big stage for a post-lunch session one of the two days.\n\nAll three of us will show off different approaches to handling a set of automated functional tests.\n\nMore details later. :)",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jim Holmes",
    "Technology": "Testing",
    "URI": "/api/sessions.json/Functional-Test-Automation-Smackdown",
    "EventType": "Session",
    "Id": "6e8679cb-8e31-426a-800c-11ede407f136",
    "SessionLookupId": "Functional-Test-Automation-Smackdown",
    "SpeakerURI": "/api/speakers.json/Jim-Holmes",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Gambling for Rubyists",
    "Abstract": "If baseball is America's Pastime, then surely poker is America's Game. An iconic game of the Wild West, today it has lost much of its stigma and emerged as a preeminent game of skill and intellect, dominated by mathematicians, stock brokers, and developers. What has software development brought to this American tradition, and what lessons does poker have to offer us in return? In this talk, I'll give you a crash course in poker, discuss statistics and odds, the psychological aspects of the game, how I use Ruby to improve my poker game, and the business side of managing a career as a professional gambler... and how the skills of one profession can help us understand another.",
    "Difficulty": "Beginner",
    "SpeakerName": "Kerri Miller",
    "Technology": "Other",
    "URI": "/api/sessions.json/Gambling-for-Rubyists",
    "EventType": "Session",
    "Id": "c0cd43cf-bbb5-488d-af57-d80b1554605e",
    "SessionLookupId": "Gambling-for-Rubyists",
    "SpeakerURI": "/api/speakers.json/Kerri-Miller",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Gesture Recognition with Kinect for Windows",
    "Abstract": "Carl Franklin has done extensive work with the Kinect for Windows SDK, and now he's sharing his knowledge and code with you. Learn how his software lets you record gestures and then recognizes those gestures with an event-driven component.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Carl Franklin",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Gesture-Recognition-with-Kinect-for-Windows",
    "EventType": "Session",
    "Id": "a2af3cbe-d88a-4372-9454-c5cef8067245",
    "SessionLookupId": "Gesture-Recognition-with-Kinect-for-Windows",
    "SpeakerURI": "/api/speakers.json/Carl-Franklin",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Going Indie 101: Lessons Learned from a Over a Decade of Independence -- FULL DAY",
    "Abstract": "Breaking free from the confines of the cubicle farm and going out on your own can be one of the most satisfying things you do for your career. It can also be one of the most terrifying. Being on your own can seem like it's nothing but ponies, unicorns and rainbows, but it's a lot of work, and success is not guaranteed.\n\nMike, an independent developer since 2001, will discuss the lessons he's learned over the years along with the ups and downs he's experienced. In this updated and expanded session, he will be joined by friend and attorney Jeffrey Strauss to help answer the most common questions  he's been asked over the years. \"How do I get started?\", \"Where do I find clients?\", \"How much do I charge?\", \"Do I need a contract?\" and many others. Bring your questions and find out if the grass really is greener on the other side.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Michael Eaton and Jeff Strauss",
    "Technology": "Other",
    "URI": "/api/sessions.json/Going-Indie-101-Lessons-Learned-from-a-Over-a-Decade-of-Independence--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "a9b12ad7-092e-474e-982c-27a0e1f720dd",
    "SessionLookupId": "Going-Indie-101-Lessons-Learned-from-a-Over-a-Decade-of-Independence--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Michael-Eaton-and-Jeff-Strauss"
  },
  {
    "Title": "Google Glass on Node.js",
    "Abstract": "Google Glass is already in the hands (or on the faces) of 10,000 early adopters. And according to Forrester 12% of Americans would buy Google Glass if it were available in stores. That's more than 21 million potential users on the horizon. With Node.js still picking up steam as a Developer favorite and Google Glass being slated for release in 2014 pairing these two trend-setting technologies together makes a lot of sense. In this session we'll walk through setting up a Google application with Mirror API access, cloning a demo project, configuring it, testing it, and finally deploying it to Heroku to share with the whole world ... of early Glass adopters.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Toby Miller",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Google-Glass-on-Nodejs",
    "EventType": "Session",
    "Id": "1144ce02-fec7-4380-b693-2803c5901d88",
    "SessionLookupId": "Google-Glass-on-Nodejs",
    "SpeakerURI": "/api/speakers.json/Toby-Miller",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Hadoop Kickstarter for the Microsoft Platform",
    "Abstract": "This session will provide a kickstarter for Hadoop on the Microsoft platform. It will take the audience from installation, through upload of data and analysis to visualisation of results via PowerBI. It's a must for any developer who is interested to find out how the data science/big data wave is going to impact them and what skills are needed work in this market.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Gary Short",
    "Technology": "Other",
    "URI": "/api/sessions.json/Hadoop-Kickstarter-for-the-Microsoft-Platform",
    "EventType": "Session",
    "Id": "e192c0cd-9522-443d-9d7a-b4e409fc9312",
    "SessionLookupId": "Hadoop-Kickstarter-for-the-Microsoft-Platform",
    "SpeakerURI": "/api/speakers.json/Gary-Short",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Hadoop's Friends - A Big Data Arsenal -- HALF DAY",
    "Abstract": "Whether you attended the Introduction to Hadoop pre-compiler or have some experience with Hadoop, this pre-compiler will take you to the next level with Hadoop by showing you how to utilize Hadoop's powerful accessorial tools such as Hue, Hive, Pig, Flume and Mahout. You will learn how to organize your data, get analytics, and even invoke machine learning to drive a recommendation engine like those used by Netflix, Amazon, and countless dating sites.\n\nYou will tour these technologies in a pre-configured environment to make large scale data transformations and queries using the power of MapReduce without the need for Java code. You will also explore the world of machine learning by writing (Java) code that finds patterns and relationships in data through clustering and classifying strategies as you harness the power of MapReduce to elicit informed recommendations from data.",
    "Start": "2014-01-08T18:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Christopher Judd and Marc Peabody",
    "Technology": "Java",
    "URI": "/api/sessions.json/Hadoops-Friends--A-Big-Data-Arsenal--HALF-DAY",
    "EventType": "PreCompiler",
    "SecondarySpeakerName": "Marc Peabody",
    "Id": "ac792568-8a29-465b-820b-2c2ffbf1e585",
    "SessionLookupId": "Hadoops-Friends--A-Big-Data-Arsenal--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Christopher-Judd-and-Marc-Peabody"
  },
  {
    "Title": "Hands On DevOps -- FULL DAY",
    "Abstract": "This precompiler will cover the DevOps Toolbox, a step-by-step tutorial for budding devops engineer who wants to enjoy the wonders of modern system configuration and management without having to become the \"Server Guy\".\n\nThe goal of this tutorial is to to teach you how to start simple, slowly adding more devops building blocks, and finally ending up with a reusable toolkit for you and your coworkers. This precompiler will take you from a fresh os install all the way through cloud server creation/deployment using Chef and Puppet.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Michael Crute",
    "Technology": "Continuous Deployment",
    "URI": "/api/sessions.json/Hands-On-DevOps--FULL-DAY",
    "EventType": "PreCompiler",
    "SecondarySpeakerName": "Chris Laco",
    "SecondarySpeakerBio": "Chris comes to us from the Akron, OH area where he's been a programmer, webmaster, server magician and all around jack of all trades in the industry for over 17 years in various languages including Perl, Ruby, C#, VB.NET, Python and remembers what a modem and Mosaic 1.0 looks like. He is currently living the DevOps lifestyle at Rackspace: The Open Cloud Company based in San Antonio, TX.\n",
    "Id": "24066bdf-eba5-4f43-bec5-fd0234bcc2fe",
    "SessionLookupId": "Hands-On-DevOps--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Michael-Crute"
  },
  {
    "Title": "Hands-on Rails in the Cloud -- FULL DAY",
    "Abstract": "Join EngineYard and Microsoft for a one-day precompiler workshop to get your hands-on using Ruby on Rails, Windows Azure and EngineYard Platform as a Service. You will learn the value of hosting in the cloud and integrating with cloud services such as compute, storage and data. Bring your laptop as we will get your hands-on with building a Ruby on Rails application, integrated with Windows Azure services and deployed to an EngineYard instance in the cloud.\r\n \r\nTopics we plan to cover include:\r\n·        Learning how the cloud can be the best solution for your application\r\n·        Understanding differences between self-hosted, IaaS & PaaS\r\n·        Acquiring best practices for platform and application architecture\r\n·        Leveraging cloud services from EngineYard and Microsoft Windows Azure.\r\n·        Improving how you deploy, scale, monitor and troubleshoot your applications and environments\r\n·        Walking away with a better knowledge of how the cloud works and how it can work for you",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "PJ Hagerty",
    "Technology": "Cloud",
    "URI": "/api/sessions.json/Handson-Rails-in-the-Cloud--FULL-DAY",
    "EventType": "PreCompiler",
    "SecondarySpeakerName": "Brian Benz",
    "SecondarySpeakerBio": "Brian is a Senior Technical Evangelist for Microsoft Open Technologies, Inc., a subsidiary of Microsoft Corporation. These days Brian spends  his time helping open source software developers and customers recognize the value and benefits of working on the Cloud with Windows Azure, open source software and devices.",
    "Id": "ddb83e2d-0d69-480a-b8af-e3ef48522c9a",
    "SessionLookupId": "Handson-Rails-in-the-Cloud--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/PJ-Hagerty"
  },
  {
    "Title": "Hardware Interaction with JavaScript",
    "Abstract": "Just a few years ago the only way you could perform task like machine vision, speech recognition was to program something in Java, C#, C++, or C. \n\nBut now with HTML5/Canvas, web speech api's, and NodeJS controlling hardware can be done with as little as a browser and some JavaScript.\n\nThis talk I will be focusing on the programing of my latest robot: J.A.C.O.B. - Just Another Camera Operating Bot.\n\nJ.A.C.O.B. is a person sized robot that operates via voice command and machine vision. It follows follow me around recording me with an HD Camera.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Scott Preston",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Hardware-Interaction-with-JavaScript",
    "EventType": "Session",
    "Id": "553f62b3-dee7-4abb-819d-ce4e13b2562e",
    "SessionLookupId": "Hardware-Interaction-with-JavaScript",
    "SpeakerURI": "/api/speakers.json/Scott-Preston",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Hippie Free Backbone: Beyond the To Do List - HALF DAY",
    "Abstract": "Have you heard about Backbone and thought single-page applications were unpossible? Tired of examples that only show shiny new Backbone.js applications? In our precompiler, we'll show you how to leverage these tools to improve an old, busted website that could use a little love. Indeed, there aren't any websites out there like that, but we’ll arm you with some tools to change them should you ever encounter the rare case…\n\nYou may be hearing more and more about Angular.js and Ember, but getting up to speed quickly on backbone is still a thing. If you're interested in adding organization and testability to an existing website, then the simplicity of backbone.js can help your incorporate those features with just a few libraries instead of a big JavaScript framework -- and the learning curve that comes with it.\n\nWe'll start by delving into the dark corners of JavaScript, examining the syntax, common practical patterns, and other idiosyncrasies. After our intro, we'll work on our example app, and turn \"pretty good\" JavaScript into code that displays separation of concerns and code that is easily testable. We'll use Backbone.js, the Underscore.js tools included with Backbone.js, and the Jasmine testing framework to treat your client-side code like a first class citizen without overhauling your existing application.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Michael Joseph Kramer",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Hippie-Free-Backbone-Beyond-the-To-Do-List--HALF-DAY",
    "EventType": "PreCompiler",
    "SecondarySpeakerName": "Tim Wingfield",
    "Id": "151d809e-677c-468f-aa04-c055906d79fd",
    "SessionLookupId": "Hippie-Free-Backbone-Beyond-the-To-Do-List--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Michael-Joseph-Kramer"
  },
  {
    "Title": "Hit the GPU running: An ungentle introduction to using OpenGL ES in iOS",
    "Abstract": "Together we'll take a tour of developing with OpenGL ES in iOS.\n\nWe'll start with an overview on how to configure a project to render with OpenGL ES. Then on to some of the basic math (math!) involved. Before you know it, we'll be submitting geometry to the GPU and attaching attributes to vertices. We'll use GLSL to write shaders for texturing and lighting.\n\nGraphics development can be a bit scary if it's not something you're used to. New vocabulary, new concepts, and that pesky math can all be a hindrance. Together we'll try to overcome these obstacles so that you can be off and running free - and your next app can feature some killer graphics.\n\nTake my hand, have no fear. We got ground to cover!",
    "Difficulty": "Intermediate",
    "SpeakerName": "Brian Stanek",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Hit-the-GPU-running-An-ungentle-introduction-to-using-OpenGL-ES-in-iOS",
    "EventType": "Session",
    "Id": "4313b814-8313-46e3-8a01-7ac5eaa8323c",
    "SessionLookupId": "Hit-the-GPU-running-An-ungentle-introduction-to-using-OpenGL-ES-in-iOS",
    "SpeakerURI": "/api/speakers.json/Brian-Stanek",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "How Netflix architects for survival.",
    "Abstract": "In this session I will discuss how Netflix designs their systems and deployment processes to help the service survive both catastrophic events like zone and regional outages and less catastrophic events like network latency and random instance death.  This system has previously been described as \"dream devops\".  Topics will include our software lifecycle from code checkin to automated machine image baking to deployment, monitoring and alerting, and how Netflix uses self service tools to enable our developers to maintain maximum code velocity.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jeremy Edberg",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/How-Netflix-architects-for-survival",
    "EventType": "Session",
    "Id": "51f7d141-e822-465d-83a2-c6985165a711",
    "SessionLookupId": "How-Netflix-architects-for-survival",
    "SpeakerURI": "/api/speakers.json/Jeremy-Edberg",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "How to be a functional programmer without being a jerk about it.",
    "Abstract": "It's OK to admit it: All your friends are coming in to work in the morning talking about that wicked sweet algorithm they wrote in like 3 lines of OCaml, and you're a little jealous. You went and downloaded haskell and clojure and started playing around and then: \"OH GOD HOW DO I WRITE A LOOP WAIT WHY SHOULD I CARE ABOUT HOMOICONICITY WHAT DO YOU MEAN MONAD WTF IS ZYGOHISTOMORPHIC PREPROMORPHISM I JUST WANTED TO WRITE A PROGRAM\"\n\nIt's cool. We won't tell anybody.\n\nIf you've been having higher-order-function envy, we've got the perfect thing for you -- we're holding a support group for the object-ively minded, to help you recover and learn to live functionally. We'll look at some common terms and problem-solving patterns in a comfy JVM language, and you'll leave feeling relieved that the next time your co-worker needs help figuring out why his recursion is not tail-call optimized, you'll be there to show him how to fix it.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Nathan Dotz",
    "Technology": "Languages",
    "URI": "/api/sessions.json/How-to-be-a-functional-programmer-without-being-a-jerk-about-it",
    "EventType": "Session",
    "Id": "d88d8c64-cc92-48d7-9975-d7f922779b1c",
    "SessionLookupId": "How-to-be-a-functional-programmer-without-being-a-jerk-about-it",
    "SpeakerURI": "/api/speakers.json/Nathan-Dotz",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "How to Start a Company",
    "Start": "2014-01-10T20:35:00Z",
    "Room": "Salon D",
    "Difficulty": "Beginner",
    "SpeakerName": "Benjamin Winkler",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/How-to-Start-a-Company",
    "EventType": "Session",
    "Id": "6563b87f-5075-42c2-af22-a06edbc4e6bf",
    "SessionLookupId": "How-to-Start-a-Company",
    "SpeakerURI": "/api/speakers.json/Benjamin-Winkler",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "How We Build Realtime Systems At bitly",
    "Abstract": "At bitly we see over 6 billion clicks/month from all over the web.  In addition to safely redirecting all of those clicks, we do a ton of analysis.  With this analysis we help our users understand what their audience and the wider web care about, throughout the past and right now.\n\nOn the \"simple\" side we can instantly tell you how many clicks we've seen on a given link.  Beyond that we can tell you what links are most popular and bursting for a given domain, topic, geographic region, audience, and more.\n\nTo accomplish this we have dozens of systems running on hundreds of hosts and they all communicate through a system that we built called NSQ.  NSQ is a distributed realtime messaging system.  NSQ scales horizontally, gracefully deals with failure, has no single point of failure, is dynamically configured, and has solid management tools.\n\nThis talk introduces the basic concepts behind NSQ and how we use it to build scalable, distributed, realtime systems at bitly.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Sean O'Connor",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/How-We-Build-Realtime-Systems-At-bitly",
    "EventType": "Session",
    "Id": "4413ac32-ce1c-43f8-9bc3-fe5a19b46277",
    "SessionLookupId": "How-We-Build-Realtime-Systems-At-bitly",
    "SpeakerURI": "/api/speakers.json/Sean-OConnor",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "How we built a Cloud Platform at Riot Games using NetflixOSS",
    "Abstract": "The Netflix OSS Cloud stack is clearly a great set of components for building a cloud infrastructure and platform—if you are Netflix. But how does that architecture work for other businesses? Learn how at Riot we leveraged the NetflixOSS Cloud tools and platform components to create a complete infrastructure in AWS for hosting our global game platform. Maybe it can work for you too.\n\nThis session will describe the specific tools and services from the NetflixOSS stack that we used, our adaptations and extensions, and how we put them together with a nifty Java library stack to form a cohesive platform.\n\nOn the Java development side, we adopted Dropwizard, added in some of the NetflixOSS libraries plus some of our own magic sauce to create a simple framework for quick development of robust, cloud-ready Java services.\n\nWe adopted Aminator's pre-baked image model, but extended baking to use Chef Solo to leverage our existing cookbook library. And instead of using Chef at launch for bootstrapping and configuration, we use Eureka for service discovery and an built an Archaius service for dynamic configuration.\n\nWe use Asgard as our general cloud portal, but have extended it with user authorization to fit our engineering environment. And, we use Edda and the Simian Army for security and conformance auditing, as well as routine cleanup tasks.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Carl Quinn",
    "Technology": "Java",
    "URI": "/api/sessions.json/How-we-built-a-Cloud-Platform-at-Riot-Games-using-NetflixOSS",
    "EventType": "Session",
    "Id": "7a9ac2e4-1991-4a60-8c41-0517306c0cb9",
    "SessionLookupId": "How-we-built-a-Cloud-Platform-at-Riot-Games-using-NetflixOSS",
    "SpeakerURI": "/api/speakers.json/Carl-Quinn",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "HTML5 Workshop -- HALF DAY",
    "Abstract": "The term \"HTML5\" is batted about constantly these days - but what, exactly, it entails can still be a mystery to many. From new JavaScript APIs and new markup elements to powerful new CSS features, understanding the next evolution of the technologies that make the web is an essential part of any developer's skill set.\n\nWe'll journey together through \"HTML5\" - and all the things that get lumped under this broad umbrella - using real code examples, discussing browser support and polyfill options. Before we're done, we'll take a peek at some of the exciting (& newer) things on the horizon for the web and mobile as well.\n\nThis session will include downloadable labs for attendees to test out what they've learned on their own, if they desire.",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T17:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Jim Cowart",
    "Technology": "Other",
    "URI": "/api/sessions.json/HTML5-Workshop--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "58284eff-09d6-4ae0-988d-663e885ebdd5",
    "SessionLookupId": "HTML5-Workshop--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Jim-Cowart"
  },
  {
    "Title": "Humanitarian Toolbox Workshop -- FULL DAY",
    "Abstract": "The Humanitarian Toolbox builds software for Humanitarian Relief efforts. Spend a day (or more) with us working on active Open Source projects that have been requested by world wide relief organizations.  Bring your laptop, bring your skills, and help the world.\n\nDifferent projects use different technologies and different platforms.  If you know any of: ASP.NET, Ruby, CSS, Javascript, HTLM5, iOS, Android, Windows 8, or Windows Phone 8, we have projects that need your help.\n\nvisit http://github.com/HTBox for information on active projects.",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Bill Wagner",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Humanitarian-Toolbox-Workshop--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "d6ab9ca4-f4e1-4c7e-b730-cbeb351b6cbf",
    "SessionLookupId": "Humanitarian-Toolbox-Workshop--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Bill-Wagner"
  },
  {
    "Title": "I Only Want to Write My App Once: Using Xamarin to Build Multi-Platform Mobile Apps",
    "Abstract": "OK, you have decided to write your first mobile application. First question, which platform are you going to target? This is a question that pops up in every developer’s head when they decide to enter the mobile space and with that space being as divided as it is, the answer is never clear-cut. Once you make that decision you potentially have cut off access to other marketplaces.\n\nIn this talk, I will show you how you can create one application that deploys across the three major mobile platforms – iOS, Android, and Windows Phone.  To do this we will turn to Xamarin. Xamarin allows you to create a .NET backend for use with Windows Phone, iOS, and Android front ends. We’ll discuss the strengths and weaknesses of this tool. When I’m done, you’ll know how to create a fully featured, standards-compliant, store-accepted app without the headache of maintaining three redundant codebases. \n\nYou have no excuse now not to get started creating the next great mobile app.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jerrel Blankenship",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/I-Only-Want-to-Write-My-App-Once-Using-Xamarin-to-Build-MultiPlatform-Mobile-Apps",
    "EventType": "Session",
    "Id": "2895d488-aa24-4d9f-839f-75901ca8785b",
    "SessionLookupId": "I-Only-Want-to-Write-My-App-Once-Using-Xamarin-to-Build-MultiPlatform-Mobile-Apps",
    "SpeakerURI": "/api/speakers.json/Jerrel-Blankenship",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Intermediate Software Craftsmanship -- HALF DAY",
    "Abstract": "Join your peers and fellow craftsmen in a variety of coding kata and exercises designed to improve your skills as software developers. Led by organizers of the Hudson Software Craftsmanship group, this interactive session will help you sharpen your tools and learn from others. Experienced developers from all backgrounds are welcome, as are beginners (who might consider attending the morning's Beginning Software Craftsmanship session, though it's not required). Attendees should already be comfortable with a programming language of their choice and if possible should bring along a laptop computer with their development tools installed, including a unit testing tool.  This session will focus on group design, refactoring, and application of design patterns to improve the design of existing software.",
    "Start": "2014-01-08T18:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Steve Smith",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Intermediate-Software-Craftsmanship--HALF-DAY",
    "EventType": "PreCompiler",
    "SecondarySpeakerName": "Brendan Enrick",
    "SecondarySpeakerBio": "Brendan Enrick is a Lead Developer in Telerik's Services Department, where he leads a team of software craftsmen building software solutions. Brendan is one of the founders and organizers of the HudsonSC group, which is a Software Craftsmanship group meeting monthly in Hudson, Ohio for over 4 years. Additionally, through HudsonSC, Brendan organizes and runs workshops to promote and introduce Software Craftsmanship's principles to professional developers.\n\nBrendan keeps a software development blog focusing on software craftsmanship, agile, and other development topics. His blog can be found at http://Brendan.Enrick.com/ and his twitter alias is @Brendoneus.",
    "Id": "120f5a53-95f8-4483-a0fd-5f8615ea694a",
    "SessionLookupId": "Intermediate-Software-Craftsmanship--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Steve-Smith"
  },
  {
    "Title": "Intro to iOS 7 using Xcode 5 -- FULL DAY",
    "Abstract": "This full day tutorial is a hands-on introduction to creating apps for the latest version of Apple's iOS using the latest version of Apple's tools.\n\nCome with the latest public release of Xcode installed on your laptop and we'll spend the morning learning the language, tools, and techniques of iOS development. \n\nYou'll learn enough Objective-C to enable you to create objects and communicate among them using properties, methods, and blocks. You'll wander around Xcode a bit so that you feel comfortable with creating user interfaces and connect elements to your code. We'll finish the morning with a look at how we use MVC in Cocoa Touch - the View Controller runs the show!\n\nAfter lunch we'll explore different application architectures with the view controller. You'll meet the delegate pattern in the context of a table based application. We'll add a second scene to our storyboard and learn to communicate forward and backwards across a segue in three different ways. We'll finish the day with more sophisticated methods of communication: notifications and key value observing.",
    "Start": "2014-01-08T13:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Daniel Steinberg",
    "Technology": "Mac/iPhone",
    "URI": "/api/sessions.json/Intro-to-iOS-7-using-Xcode-5--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "0b5cb161-7db4-4ed4-8c4f-980c463dcf2e",
    "SessionLookupId": "Intro-to-iOS-7-using-Xcode-5--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Daniel-Steinberg"
  },
  {
    "Title": "Intro to MongoDB Workshop -- HALF DAY",
    "Abstract": "This tutorial will be a crash course in the basics of how to use MongoDB, as well as an introduction to some of MongoDB’s core design principles. We’ll start by going over the fundamentals of what MongoDB is, use that as context for starting a simple application, and finish off by showing how to set up MongoDB Replica Sets and Sharded Clusters.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T17:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Sridhar Nanjudeswaran",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Intro-to-MongoDB-Workshop--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "59f0e038-b197-4327-8581-701942e5e929",
    "SessionLookupId": "Intro-to-MongoDB-Workshop--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Sridhar-Nanjudeswaran"
  },
  {
    "Title": "Introduction to Front-End Tooling",
    "Abstract": "A introduction to the modern front-end developer's toolbox. We'll cover such topics as CSS pre-processors, demystifying source control, writing more modular markup and styles with Handlebars and YAML, and examine how to use things like Yeoman, Bower, and Grunt. A big focus on this talk is ensuring we are all using the sharpest tools to not only create the best web experiences possible, but to also create the best development environments possible as well.",
    "Difficulty": "Beginner",
    "SpeakerName": "Adam Simpson",
    "Technology": "Design/UX",
    "URI": "/api/sessions.json/Introduction-to-FrontEnd-Tooling",
    "EventType": "Session",
    "Id": "70b1a3b8-7a73-48c2-9e9f-cb0e2347c18a",
    "SessionLookupId": "Introduction-to-FrontEnd-Tooling",
    "SpeakerURI": "/api/speakers.json/Adam-Simpson",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Introduction to Hadoop",
    "Abstract": "Big data is a rapidly growing trend, and Hadoop is arguably the foremost implementation of this technology.  And for good reason, it has opened possibilities that were previously impossible or impractical with other architectures (for example, Hadoop holds the record for world's fastest large data sorter, clocking in at 1.42TB/min this year).  With the volume of data rapidly growing, many have been forced to rethink their approach.  Several major organizations have Hadoop clusters running, including Amazon, EBay, Facebook, the NSA, and Yahoo, to name a few.  This session introduces solving problems with map-reduce, using the Hadoop API, the function of the core components of Hadoop, how other components of the ecosystem relate to each other, and how to test your jobs.  At the end of this session, attendees will understand the basics of how Hadoop works, what the components of Hadoop ecosystem are, and be able to write, test and run their first job.",
    "Difficulty": "Beginner",
    "SpeakerName": "Keegan Witt",
    "Technology": "Java",
    "URI": "/api/sessions.json/Introduction-to-Hadoop",
    "EventType": "Session",
    "Id": "7ea062a1-7e97-40e7-b68b-f508ef618d96",
    "SessionLookupId": "Introduction-to-Hadoop",
    "SpeakerURI": "/api/speakers.json/Keegan-Witt",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Introduction to Hadoop -- HALF DAY",
    "Abstract": "As an industry we are collecting more and more data. At some point we have to be able to make sense of the data. Unfortunately many of the tools we have historically used can not scale up to the terabytes and petabytes we have captured. Hadoop is one of those relatively new technologies that is taking the industry by storm since it has proven to scale by taking advantage of the MapReduce pattern and distributed computing.\n\nDuring this hands-on tutorial you will provision a Hadoop cluster, write MapReduce jobs and learn how to store and access data via Hadoop Distributed File System (HDFS). You will also learn how cloud providers such as Amazon Web Services’ Elastic MapReduce (EMR) and Microsoft’s Azure HDInsight provide Hadoop as a service.\n\nNote: Amazon Web Services and Microsoft Azure accounts are a nice to have and will incur a minimal cost during the tutorial but is not a requirement. Access to AWS and Azure will be provided to you if you don’t already have access.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T17:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Christopher Judd and Marc Peabody",
    "Technology": "Java",
    "URI": "/api/sessions.json/Introduction-to-Hadoop--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "a7d65548-4e1f-469e-b077-4bd8517f0063",
    "SessionLookupId": "Introduction-to-Hadoop--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Christopher-Judd-and-Marc-Peabody"
  },
  {
    "Title": "Introduction to the Roku SDK -- HALF DAY",
    "Abstract": "Ready to rock the Roku? A 2013 survey shows the Roku is the most-used streaming media box, and that's due in part to all the stuff available for it. There are hundreds of Roku-approved channels you can install, all built with Roku's public SDK.\n\nSo how do you build a channel? In this half-day precompiler, we'll put our Rokus into developer mode and start uploading our own application code to them, from Hello World to basic streaming to more sophisticated content collections. Roku apps are all about getting the viewer to their content and then getting out of the way, and we'll see how the API is optimized for that, but also how you can \"go big\" and do some neat stuff if that makes sense for your application. This being a streaming device, we will also cover how to create the HTTP Live Streaming (HLS) streams that Roku supports.\n\nParticipants will need to bring the following: 1. A Roku 2nd or 3rd generation unit (Roku LT, HD, XD, XS, 1, 2, or 3 should all work) with its power cord. 2. The original remote control (using the Roku smartphone app WILL NOT WORK). 3. Some means of seeing what's on the screen, either via a capture card into your laptop (preferred) or a second display. You can also join the Roku developer program at http://www.roku.com/developer and download the SDK, although this is not strictly necessary to participate in the precompiler (the SDK primarily consists of documentation and examples).",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T17:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Chris Adamson",
    "Technology": "Other",
    "URI": "/api/sessions.json/Introduction-to-the-Roku-SDK--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "bd2af6bc-db53-48ea-b816-6d927a2dc2dd",
    "SessionLookupId": "Introduction-to-the-Roku-SDK--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Chris-Adamson"
  },
  {
    "Title": "Java.Next: An overview of Java 8",
    "Abstract": "The next release of Java (8) promises a variety of new features, including Lamda expressions, annotations and a new date/time API.  We'll review these and other notable additions to the Java platform, plus provide code samples and demonstrations of the new features of Java 8.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Scott Seighman",
    "Technology": "Java",
    "URI": "/api/sessions.json/JavaNext-An-overview-of-Java-8",
    "EventType": "Session",
    "Id": "c0700e0d-3709-48bc-8015-fdec66c66397",
    "SessionLookupId": "JavaNext-An-overview-of-Java-8",
    "SpeakerURI": "/api/speakers.json/Scott-Seighman",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "JavaEE.Next(): Java EE 7, 8, and Beyond",
    "Abstract": "Java EE 7 is here and the horizons for Java EE 8 are emerging. This session looks into the key changes the community can expect. The goal of this session is to foster interest and discussion around these changes.\n\nSome of the changes discussed include retiring EJB 2 entity beans and JAX-RPC, greater alignment with CDI, WebSocket/HTML 5 support, a standard API for JSON processing, the next version of JAX-RS, an overhaul of JMS, long-awaited concurrency utilities, batch processing in Java EE and much, much more.",
    "Difficulty": "Beginner",
    "SpeakerName": "Reza Rahman",
    "Technology": "Java",
    "URI": "/api/sessions.json/JavaEENext-Java-EE-7-8-and-Beyond",
    "EventType": "Session",
    "Id": "ca803907-3c12-47c0-b922-c63eb297a14b",
    "SessionLookupId": "JavaEENext-Java-EE-7-8-and-Beyond",
    "SpeakerURI": "/api/speakers.json/Reza-Rahman",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Lessons from a Grizzled Speaker",
    "Abstract": "Thinking about speaking at your local user group? Or maybe at your favorite conference? Don’t know where to get started? This session is for you.\n\nIn this session, a seasoned speaker who’s been speaking at conferences and user groups for more years than he wants to think about will guide you through the process from writing your abstract to presenting your talk well. These tips will give your abstract a higher chance of being accepted and you the confidence that you need to land your talk well. ",
    "Difficulty": "Beginner",
    "SpeakerName": "Josh Holmes",
    "Technology": ".NET",
    "URI": "/api/sessions.json/Lessons-from-a-Grizzled-Speaker",
    "EventType": "Session",
    "Id": "24862ea9-0a67-4578-a19c-4e7eddb2202c",
    "SessionLookupId": "Lessons-from-a-Grizzled-Speaker",
    "SpeakerURI": "/api/speakers.json/Josh-Holmes",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Let's Build Skynet In An Hour",
    "Abstract": "Watching Terminator as a child (why shouldn't 8 year olds watch Arnold?) sparked my love of robots. Like most fans, I was fascinated by the idea of autonomous machines becoming a reality. As I grew older, I eventually realized that the real challenge wasn’t building a Terminator but, rather, the network that dictated its decisions.\n\nFor Skynet to make those decisions, it needs data, and LOTS of it. We currently carry in our pockets one of the greatest data collection devices ever created by mankind: our smartphone. The problem, however, lies directly in mankind’s involvement—the human decides what the device sees. That is, until recently. Romotive, a new robot that takes the unique approach of having an iOS device for a brain, solves the issue. As a result, the network can gather input on its own.\n\nIn this session, we’ll build a rudimentary Skynet in an hour. The Romotive SDK enables our robot to move. CoreImage identifies targets and Azure stores the data so it can learn over time. In the end, we will have a moving and thinking robot … ultimately deciding who lives, and who is terminated.",
    "Difficulty": "Advanced",
    "SpeakerName": "Joshua Gretz",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Lets-Build-Skynet-In-An-Hour",
    "EventType": "Session",
    "Id": "fbe0a992-3a21-48ab-aa60-0b9673e5e879",
    "SessionLookupId": "Lets-Build-Skynet-In-An-Hour",
    "SpeakerURI": "/api/speakers.json/Joshua-Gretz",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Liberate the Front-End",
    "Abstract": "For far too long client-side code has been held hostage in the clutches of the evil server-side! Enough is enough! Now is the time to liberate your JavaScript from these arcane environments and move them into a modern workflow where preprocessors, test runners, and transpilation tools are platform agnostic, performant and fun! Join us at this session as we explore why the server-side should stick to what it is good at: security, authentication, services, and data storage; along the way we will explore some of the benefits of migrating your JavaScript to a front-end optimized tooling stack using Node.JS and Grunt.",
    "Difficulty": "Intermediate",
    "SpeakerName": "David Mosher",
    "Technology": "Design/UX",
    "URI": "/api/sessions.json/Liberate-the-FrontEnd",
    "EventType": "Session",
    "Id": "706883f8-fa7e-4872-9158-16e1f6c04f22",
    "SessionLookupId": "Liberate-the-FrontEnd",
    "SpeakerURI": "/api/speakers.json/David-Mosher",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "Log Management Made Awesome: The Kibana 3 Way",
    "Abstract": "Log management is typically tedious and involves shoving large files into a vault where you will only dust them off to laboriously troubleshoot a problem.  Using Logstash, Elasticsearch, and Kibana 3, this session will demonstrate how to effortlessly collect your logs from anywhere and index them into a central store where they can be rapidly searched and analyzed to give you insight into your entire platform.  These are all actively developed open source technologies, will run on a variety of platforms, and are becoming very popular for managing logs among DevOps.  Logstash is a tool written in Ruby for collecting logs from a variety of sources, transforming them, and shipping them to a variety of destinations.  Elasticsearch is a clustered, cloud-ready search solution powered by Java Lucene.  Kibana 3 is a client-side browser app for visualizing and searching timestamped data in Elasticsearch.  Enterprise-class log management is within your reach.",
    "Difficulty": "Beginner",
    "SpeakerName": "Nick Slowes",
    "Technology": "Other",
    "URI": "/api/sessions.json/Log-Management-Made-Awesome-The-Kibana-3-Way",
    "EventType": "Session",
    "Id": "ad911358-3039-42d6-8fae-24a7bfa0b0e5",
    "SessionLookupId": "Log-Management-Made-Awesome-The-Kibana-3-Way",
    "SpeakerURI": "/api/speakers.json/Nick-Slowes",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Make an Event of It!",
    "Abstract": "The upsurge in asynchronous programming has brought event-driven patterns to the forefront. But even if you aren't re-writing your app in Node.js, evented patterns can improve your application.\n\nThis talk demonstrates concrete examples of how events can benefit the various layers of your application. We'll see how events can pitch in the fight against fat controllers (and fat models too!) We'll apply eventing to simplify testing and decouple our app from external dependencies. We'll even see how eventing can help shape our data to provide flexibility and auditing.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jason Clark",
    "Technology": "Ruby / Rails",
    "URI": "/api/sessions.json/Make-an-Event-of-It",
    "EventType": "Session",
    "Id": "b8662d8f-fead-46c3-ae38-ba25cf14b2e3",
    "SessionLookupId": "Make-an-Event-of-It",
    "SpeakerURI": "/api/speakers.json/Jason-Clark",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Managing Terabytes on AWS",
    "Abstract": "JFrog is handling huge amount of binaries files for all our customers. Since each customer has its own space and domain, using a global Object Store can be tricky. Also our application cannot work with an \"eventually consistent\" storage, and cannot deliver customer requirements with current S3 performance. Learn in this session how we managed fast upload, critical replication and backups, and global download availability of the terabytes of JFrog customer binaries files.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Fred Simon",
    "Technology": "Java",
    "URI": "/api/sessions.json/Managing-Terabytes-on-AWS",
    "EventType": "Session",
    "Id": "3865f0ff-aac8-42ef-af6e-3b2a471d8598",
    "SessionLookupId": "Managing-Terabytes-on-AWS",
    "SpeakerURI": "/api/speakers.json/Fred-Simon",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Math for .NET Developers – Making Data that Looks Real",
    "Abstract": "This session is aimed at introducing linear algebra and statistics to a math-wary developer by solving the problem of creating real world looking data using the nuML Machine Learning Library. It is often difficult to exercise our software with the amount of data necessary for deriving useful conclusions. In this session, attendees will earn how to use the power of linear algebra and statistics to generate an infinite amount of real world data, which can be used for both UI and Load Testing.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Seth Juarez",
    "Technology": "Windows / .NET",
    "URI": "/api/sessions.json/Math-for-NET-Developers--Making-Data-that-Looks-Real",
    "EventType": "Session",
    "Id": "77284c01-9f95-4d16-ad77-5b48f9965736",
    "SessionLookupId": "Math-for-NET-Developers--Making-Data-that-Looks-Real",
    "SpeakerURI": "/api/speakers.json/Seth-Juarez",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Migrating from Maven To Gradle... Best of breed or just the least evil?",
    "Abstract": "Are you using Maven for your project builds because it was the least evil of the tools you could find?  Our team was too... until we started using Gradle.  Gradle claims to be \"Build automation evolved\"  Is that true?  If so, what makes it true?   We will discuss the trials and travails of migrating a complex multi-module project from Maven to Gradle.  What compelled us to make the change, and what benefits have we realized since the change was made?   We will also discuss the rough edges we encountered during both our migration and our day to day use.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Bryan Davis",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Migrating-from-Maven-To-Gradle-Best-of-breed-or-just-the-least-evil",
    "EventType": "Session",
    "Id": "3190b3f3-04a6-40b3-bfd5-b0be55909963",
    "SessionLookupId": "Migrating-from-Maven-To-Gradle-Best-of-breed-or-just-the-least-evil",
    "SpeakerURI": "/api/speakers.json/Bryan-Davis",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Mixing Functional programming with OO",
    "Abstract": "We don't have to choice between functional programming and object oriented programming. We can use both. They both provide a number of problem-solving styles so that a programmer can select the solution technique that best matches the characteristics of the problem to be solved.\nFunctional programming is great but how do we use it in our day to day programming? Most of us struggling with that. \n- What about the design patterns?\n- How do I dependency Injection?\n- Domain modeling\n\nHow about we take something we are familiar with like object oriented programming and slowly refactor our way into functional programming. This will help us in exploring functional programming and how to its techniques could be use in day to day programming.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Nilanjan Raychaudhuri",
    "Technology": "Languages",
    "URI": "/api/sessions.json/Mixing-Functional-programming-with-OO",
    "EventType": "Session",
    "Id": "5c964518-a5d2-4405-abeb-fb2464616421",
    "SessionLookupId": "Mixing-Functional-programming-with-OO",
    "SpeakerURI": "/api/speakers.json/Nilanjan-Raychaudhuri",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Mobile Application Security? There's a Session for That!",
    "Abstract": "The bad news - after this talk you may not feel too good about all those apps you install on your phone.\n The good news - There is still time for many developers looking at developing mobile applications in the near future to learn and implement security from the beginning!\n \n In this session we will discuss mobile development trends that developers need to know about and the security issues they introduce. Topics may include BYOD, jailbreaking, infrastructure, architecture, and more. Once we are all scared of our phones, we will talk about education, tools, and other mobile security resources that developers can use to evaluate the security risks associated with mobile development efforts in the enterprise. The web is hosed, but new mobile applications don't have to be - let's get started on the right foot!",
    "Difficulty": "Advanced",
    "SpeakerName": "Benjamin Floyd",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Mobile-Application-Security-Theres-a-Session-for-That",
    "EventType": "Session",
    "Id": "8a990414-5f65-44f6-8085-f5139ea3f71a",
    "SessionLookupId": "Mobile-Application-Security-Theres-a-Session-for-That",
    "SpeakerURI": "/api/speakers.json/Benjamin-Floyd",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Modern Web Development Workflow backed by .NET",
    "Abstract": "The client-side toolset is moving faster than the Visual Studio release cycle. While Visual Studio remains king of .NET development, modern web interfaces have shifted away from server-generated HTML and into JavaScript libraries like Angular or Ember. This talk focuses on breaking your web UI out of Visual Studio and making it a isolated, testable, first-class citizen like you would do for your Android or iOS applications. Learn how to create powerful, rich web interfaces using the right tools for the job while retaining server-side logic in the languages you know.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jay Harris",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Modern-Web-Development-Workflow-backed-by-NET",
    "EventType": "Session",
    "Id": "7cb788c2-0ae5-4744-a121-f87f56de18d7",
    "SessionLookupId": "Modern-Web-Development-Workflow-backed-by-NET",
    "SpeakerURI": "/api/speakers.json/Jay-Harris",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "MongoDB and Meeting Your Storage Needs",
    "Abstract": "If you ask a developer about the benefits of MongoDB, you would probably hear things like speed, flexibility and ease of handling large amounts of data. Mongo developers know that it does provide all of these features, but not directly out of the box without major work and some creativity. In this session, we will discuss some lessons learned from a Mongo implementation that has been in heavy production use for years. It will draw upon roadblocks encountered in development and production to attempt to help others avoid similar issues.\n\nThis session will focus on exploring the pros and cons of a large scale MongoDB implementation. We will study its benefits over other database solutions and ability to work in tandem with those technologies. C# integration code will be explored to demystify how Mongo works and preconceived notions. We will also study several strategies to improve speed, reliability and data validity. Finally, this session will spend time with the Javascript integration, showing how the ease of CRUD operations and how Javscript and MongoDB can easily replace and improve on SQL scripting. Attendees will have a strong grasp on many MongoDB concepts as well as a framework for exploring how it might work for their situations.",
    "Difficulty": "Beginner",
    "SpeakerName": "Brett S Berliner",
    "Technology": "Other",
    "URI": "/api/sessions.json/MongoDB-and-Meeting-Your-Storage-Needs",
    "EventType": "Session",
    "Id": "c6a92f7f-d2d5-43e3-9ca8-12042b6b25d2",
    "SessionLookupId": "MongoDB-and-Meeting-Your-Storage-Needs",
    "SpeakerURI": "/api/speakers.json/Brett-S-Berliner",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "More Cache for Less Cash",
    "Abstract": "In this session we will introduce the new Windows Azure Cache Service. This is the next generation cache technology for Windows Azure to replace the current Shared Caching service. During this session we will cover the new scenarios that the service enables in Windows Azure and the features that differentiate it from the legacy cache service. We will also demo how to provision and manage the new service.",
    "Difficulty": "Beginner",
    "SpeakerName": "Michael Collier",
    "Technology": "Windows / .NET",
    "URI": "/api/sessions.json/More-Cache-for-Less-Cash",
    "EventType": "Session",
    "Id": "bd64abb4-052b-4250-8dc4-d33bb246ac02",
    "SessionLookupId": "More-Cache-for-Less-Cash",
    "SpeakerURI": "/api/speakers.json/Michael-Collier",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "Motorizing a 44” x 8” Telescope from Scratch",
    "Abstract": "It is a wonderful undertaking to design and make your own thing from scratch. Consider joining me as we discuss what is required to develop a quality precision drive system for a 24lb telescope.  We will cover many phases of this project, including how to create a 3D CAD model for brainstorming, how to compute torque requirements, how to control intelligent stepper motors, how to compute the needed reduction ratio and select the appropriate worm gears, how to specify the parts that need to be machined or printed, how to choose and mount the digital camera, and finally, what to consider when writing completely custom code (in C#) to bring this project to life. They joy of this project is that it encompasses so many different disciplines and technologies without using any pre-manufactured kits or designs. The actual telescope is an 8” Newtonian Reflector on a Dobsonian mount and will be available for show-and-tell. The presenter has written code for many industrial automation systems.",
    "Difficulty": "Advanced",
    "SpeakerName": "John Michael Hauck",
    "Technology": "Hardware ( Raspberry Pi, Arduino, etc)",
    "URI": "/api/sessions.json/Motorizing-a-44-x-8-Telescope-from-Scratch",
    "EventType": "Session",
    "Id": "1e9553e4-2ff9-470d-a19e-0a0000058363",
    "SessionLookupId": "Motorizing-a-44-x-8-Telescope-from-Scratch",
    "SpeakerURI": "/api/speakers.json/John-Michael-Hauck",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Navigating the Open Source Legal Waters",
    "Abstract": "Open source tools. We all use them. Whether it’s an entire toolkit, a framework that meets some specific needs, or a simple custom control from NuGet, CodePlex, or CodeProject, it is hard to ignore the opportunity to improve our rate of development while learning new things from open source projects.\n\nBut what does “open source” truly mean? Especially when working in a professional or corporate environment, what are our rights and limitations as open source consumers to use, modify, and redistribute these tools. Often that depends upon the authors' own decisions regarding project licensing.\n\nIn this one-hour session, we will review a few of the core principals of open-source development and consumption, comparing and contrasting some of the more popular licenses in use today.  We will then discuss both how to use the open source works of others and also how to properly license your own.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jeff Strauss",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Navigating-the-Open-Source-Legal-Waters",
    "EventType": "Session",
    "Id": "bb9de83d-dc61-4a09-89a8-4fb607676a20",
    "SessionLookupId": "Navigating-the-Open-Source-Legal-Waters",
    "SpeakerURI": "/api/speakers.json/Jeff-Strauss",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "NServiceBus Crash Course -- FULL DAY",
    "Abstract": "Interested in learning how to build reliable systems? Curious to see what NServiceBus brings over technologies like WCF? Or just want to learn about reliable messaging?\n\nBring your laptop, and we'll examine through hands-on coding how NServiceBus builds reliability in. We'll tour the major messaging patterns - One-way sending, request/reply, pub/sub, sagas and more. We'll also see what NServiceBus adds on top of messaging frameworks like Azure Queues and MSMQ. Finally, I'll share some of my experiences bringing unreliable systems under control with durable messaging.",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jimmy Bogard",
    "Technology": "Other",
    "URI": "/api/sessions.json/NServiceBus-Crash-Course--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "7a29bb5a-6d85-4fb4-888e-7ddba0a5ab21",
    "SessionLookupId": "NServiceBus-Crash-Course--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Jimmy-Bogard"
  },
  {
    "Title": "NSExpressions: Everything you wanted to know but didn't know to ask",
    "Abstract": "This advanced talk is a deep dive into NSExpression class (which is\npart of the Foundation classes of Objective C on Mac OS and iOS). What\nthey are, how you can use them, why you might want to. NSExpression\nobjects are the building blocks of NSPredicates and can be a very\nuseful set of tools.",
    "Difficulty": "Advanced",
    "SpeakerName": "Joshua Smith",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/NSExpressions-Everything-you-wanted-to-know-but-didnt-know-to-ask",
    "EventType": "Session",
    "Id": "7f30b72c-afdd-4537-9568-f30ff911d0a8",
    "SessionLookupId": "NSExpressions-Everything-you-wanted-to-know-but-didnt-know-to-ask",
    "SpeakerURI": "/api/speakers.json/Joshua-Smith",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "OOP: You’re Doing It Completely Wrong",
    "Abstract": "Chances are, most of us are primarily writing in Object Oriented Languages.  But how many of us are truly doing Object Oriented Programming (OOP)?  Objects are a powerful abstraction, but when all we do is write procedural code wrapped in classes we’re not realizing their benefits.  That’s the tricky thing about OO, it’s easy to have Objects but still not be doing good OOP.  This has led to a plethora of principles and patterns and laws, which are very valuable, but also easy to misunderstand and misapply.  In this talk we’ll go back to the foundations of Objects, and take a careful look at some of the more useful OO principles.  We’ll see how many modern frameworks force us into bad OO, but why occasionally that tradeoff is worth it.  When we’re done, we’ll have a more nuanced understanding of what good OO is, what it can do for us, and when we should use it.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Kevin Berridge",
    "Technology": "Languages",
    "URI": "/api/sessions.json/OOP-Youre-Doing-It-Completely-Wrong",
    "EventType": "Session",
    "Id": "89203f0b-069e-4620-a875-606fb27e907e",
    "SessionLookupId": "OOP-Youre-Doing-It-Completely-Wrong",
    "SpeakerURI": "/api/speakers.json/Kevin-Berridge",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "Open Your Mind to Erlang",
    "Abstract": "Erlang is a functional programming language that was designed for high-concurrency, soft real-time applications. The original authors created Erlang for use in telecom devices which led to the creation of something that is different from any other language you use: completely functional with built in syntax for message passing between lightweight processes, designed to fail fast but with an application framework that deals with failure gracefully and with purpose.\n\nAs with anything new and different your first response may be fear and doubt. With its seemingly bizarre syntax and totally functional nature, Erlang seems unapproachable initially. It turns out that with a little bit of practice, the syntax begins to make complete sense and the functional aspects will open your mind to new ways of structuring your applications.\n\nIn this talk I will go through the basics of Erlang, explaining its syntax, providing code examples that show how to solve problems with functions, and talk about what Erlang is good at and what it is not so good at. So open your mind to Erlang and let me take you on a tour of this quirky and cool language.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Anthony Eden",
    "Technology": "Languages",
    "URI": "/api/sessions.json/Open-Your-Mind-to-Erlang",
    "EventType": "Session",
    "Id": "e59e2e1b-b2b0-49e6-ade3-0713da962f62",
    "SessionLookupId": "Open-Your-Mind-to-Erlang",
    "SpeakerURI": "/api/speakers.json/Anthony-Eden",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Own Your Own Career – Advice from a Veteran Consultant",
    "Abstract": "I have witnessed or committed many mistakes during my decades of consulting. I will pack into this presentation as much advice as I can about managing your career and your customer as you traverse the wilds of consulting. I’ll start with ways to take ownership of your career and responsibility for achieving your goals; then, I will teach key lessons on working with your customer in a way that benefits you both.",
    "Difficulty": "Beginner",
    "SpeakerName": "David Giard",
    "Technology": "Other",
    "URI": "/api/sessions.json/Own-Your-Own-Career--Advice-from-a-Veteran-Consultant",
    "EventType": "Session",
    "Id": "08638034-31db-4c10-ba2c-e49c783c8dd4",
    "SessionLookupId": "Own-Your-Own-Career--Advice-from-a-Veteran-Consultant",
    "SpeakerURI": "/api/speakers.json/David-Giard",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Patterns of effective test setup: Object Mother and beyond",
    "Abstract": "Writing clean, effective and manageable tests begins with the \"fixture\", the set of data used in the test. If you've ever struggled with writing the \"arrange\" part of a test, or if you've ever looked at someone else's \"arrange\" and had a hard time understanding it, then you've suffered the pains of poor fixture setup.\n\nIn this session you'll learn a collection of patterns and techniques that will help you write smaller, more expressive tests that are easier to read, understand and maintain. We'll talk about object construction patterns, integration test setup, and some common \"fixture smells\". Although code samples will be in C# and NHibernate the techniques and concepts are relevant to other platforms too.\n\n\"Clean setup begets clean tests.\" Let me show you how.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Seth Petry-Johnson",
    "Technology": "Testing",
    "URI": "/api/sessions.json/Patterns-of-effective-test-setup-Object-Mother-and-beyond",
    "EventType": "Session",
    "Id": "009f06a4-aa1b-44ea-ab70-35d2aaf35c74",
    "SessionLookupId": "Patterns-of-effective-test-setup-Object-Mother-and-beyond",
    "SpeakerURI": "/api/speakers.json/Seth-PetryJohnson",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "People, Process, Tools – The Essence of DevOps",
    "Abstract": "DevOps is about making software better – by bringing everyone involved in software closer together, including (but not limited to): domain experts, architects, developers, designers, testers, security and operations. This session takes you through the DevOps culture, focusing on people, process and tools (in that order). You’ll learn how to get the conversation started between the teams, how to bring the teams closer together, and how to ultimately become one team (we’re all in this together)! Understanding DevOps is about focusing on what’s important: building and delivering the best software you can.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Richard Campbell",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/People-Process-Tools--The-Essence-of-DevOps",
    "EventType": "Session",
    "Id": "e8bc6a11-26c5-4ae9-9e05-1b8800d138b6",
    "SessionLookupId": "People-Process-Tools--The-Essence-of-DevOps",
    "SpeakerURI": "/api/speakers.json/Richard-Campbell",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Performance In a Responsive World",
    "Abstract": "Responsive web design has changed not only the way be build the web but the way we think about the web. One of the prevailing criticisms of responsive design has been degraded performance. Understandably so. \n\nIt seems that all our shiny new media queries have caused us to lose sight of some basics. The good news is that most of the best practices for building fast sites have not changed. By going back to the basics (plus a few new tricks), we can make responsive sites fast for all devices. We’ll cover a refresher of the basics and how they can be applied while using responsive techniques, and we’ll take a look at new tools that can make the job easier.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Rob Harr",
    "Technology": "Design (HTML, CSS, etc)",
    "URI": "/api/sessions.json/Performance-In-a-Responsive-World",
    "EventType": "Session",
    "Id": "df6067b6-0bc4-4c1e-8639-17d999b66ae1",
    "SessionLookupId": "Performance-In-a-Responsive-World",
    "SpeakerURI": "/api/speakers.json/Rob-Harr",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Physical Computing Product Development with Arduino",
    "Abstract": "Alt title: Learning to Code is Awesome and You Still Love What You Do\n\nEver want to make your code talk with the real world? With the Arduino and the Processing language (Java with training wheels), doing this is actually pretty simple. In this session, we’ll walk step-by-step through a real-life client project involving hardware prototyping and development with Arduino, making these devices talk wirelessly, and displaying physical data in a custom graphical interface.\n\nThis presentation will cover the basic principles of using the Arduino and sensors to get data from the physical world, and then how to make sense of that data with simple visualizations using Processing. It will also remind you how cool code is.",
    "Difficulty": "Beginner",
    "SpeakerName": "Scott Sullivan",
    "Technology": "Hardware ( Raspberry Pi, Arduino, etc)",
    "URI": "/api/sessions.json/Physical-Computing-Product-Development-with-Arduino",
    "EventType": "Session",
    "Id": "d1864d00-851c-4305-9fc4-2c718b15deb2",
    "SessionLookupId": "Physical-Computing-Product-Development-with-Arduino",
    "SpeakerURI": "/api/speakers.json/Scott-Sullivan",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Physics And The User Interface for iOS",
    "Abstract": "Dive in to the theory and practice of using the two newest additions in iOS 7 that bring the physical dimension closer to your virtual screen: UI Dynamics and Sprite Kit Physics Bodies. We'll take a look at how to work with both of these engines to add subtle and useful pizzaz to your user interfaces and games. Slides, sample code, and fun will be provided. Bring your own Mac and Xcode.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jonathan Penn",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Physics-And-The-User-Interface-for-iOS",
    "EventType": "Session",
    "Id": "fc90acca-7acf-4915-bcb5-5fd439bd9c78",
    "SessionLookupId": "Physics-And-The-User-Interface-for-iOS",
    "SpeakerURI": "/api/speakers.json/Jonathan-Penn",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Practical Machine Learning – Recommender Engine and Anomaly Detection",
    "Abstract": "Machine learning is often perceived to be a daunting topic, when in fact its concepts are fairly intuitive and easy to use. This session will introduce nuML machine learning library basics, and will thus address the clustering issue in .NET applications by focusing on the practical real-world applications of recommendation engines and anomaly detection. At the conclusion of this session, attendees will be able to immediately use their unlabeled data to create powerful models for predicting the future based on the past.",
    "Difficulty": "Beginner",
    "SpeakerName": "Seth Juarez",
    "Technology": "Windows / .NET",
    "URI": "/api/sessions.json/Practical-Machine-Learning--Recommender-Engine-and-Anomaly-Detection",
    "EventType": "Session",
    "Id": "890c47fb-10d1-41d9-bf93-19dc1b4ac8e3",
    "SessionLookupId": "Practical-Machine-Learning--Recommender-Engine-and-Anomaly-Detection",
    "SpeakerURI": "/api/speakers.json/Seth-Juarez",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Pragmatic Architecture in .Net: Curing the Architecture Astronaut",
    "Abstract": "An architect’s job is to reduce complexity, not increase it. Yet the developer life is filled with jargon, acronyms, and seemingly infinite choices. So how do we know when complexity makes sense? Let's discuss when abstractions are justified and determine how to structure applications so they’re maintainable, scalable, and testable.\n\nWe’ll make sure everyone is comfy with the core jargon like N-Teir, separation of concerns, and loose coupling. Then we’ll dive into various patterns for implementing the three common layers using various .Net technologies. You’ll learn when table module, active record, DDD, and ORMs make sense and walk away with the tools to better evaluate and justify complexity as a agile software craftsman. We’ll focus on the value of keeping things simple whenever we can. \n",
    "Difficulty": "Intermediate",
    "SpeakerName": "Cory House",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Pragmatic-Architecture-in-Net-Curing-the-Architecture-Astronaut",
    "EventType": "Session",
    "Id": "d7ba21e6-65af-414a-9116-7a88093a155b",
    "SessionLookupId": "Pragmatic-Architecture-in-Net-Curing-the-Architecture-Astronaut",
    "SpeakerURI": "/api/speakers.json/Cory-House",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Preparing your QA team for Mobile Testing",
    "Abstract": "Rewriting your Master Testing Strategy is in order when you look to tackle your first mobile initiative. This includes getting your test environments ready for testing. Often test environments have been on closed internal networks that are not accessible from the internet. Delivering and testing a mobile application on a 3G or 4G network changes all that. Coming up with a supported platform strategy is also paramount to success. One needs to take network speed, device features, screen size and resolution as well as multi-tasking life-cycles into effect when testing. QA testers will need to become familiar on how to service the devices they test with as well. Additionally the team will need to incorporate field testing prior to delivery. This presentation will organize the challenges a modern QA team has to contend with, and make some strong suggestions on how to craft a respectable Mobile Test Strategy.",
    "Difficulty": "Beginner",
    "SpeakerName": "Geoffrey Goetz",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Preparing-your-QA-team-for-Mobile-Testing",
    "EventType": "Session",
    "Id": "ef4470d3-cf22-4afd-a300-ae5b6a42c974",
    "SessionLookupId": "Preparing-your-QA-team-for-Mobile-Testing",
    "SpeakerURI": "/api/speakers.json/Geoffrey-Goetz",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Promises A+ - Understanding the spec through implementation",
    "Abstract": "Promises have been proposed as a solution to \"callback hell\". They help relieve common problems with asynchronous programming and are making their way in to more libraries, APIs and specifications. We will look at the Promises A+ specification and the upcoming DOM standard to write an implementation that will pass the Promises A+ test suite giving us greater understanding of how Promises work and and how we can use them.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Rhys Brett-Bowen",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Promises-A--Understanding-the-spec-through-implementation",
    "EventType": "Session",
    "Id": "fb2b9c2d-32f1-40a8-9fe1-3a0ae193e085",
    "SessionLookupId": "Promises-A--Understanding-the-spec-through-implementation",
    "SpeakerURI": "/api/speakers.json/Rhys-BrettBowen",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Putting the D&D in TDD -- FULL DAY",
    "Abstract": "Are you tired of TDD workshops that make you do boring things like calculate bowling scores and prime factors or demonstrate how to win at the game of life? If so, this is the session for you! In this TDD workshop we will be building the domain model for EverCraft -- a new MMORPG from Blizzards of the Coast. We have lots of story cards prepared covering features from combat to magic, classes to spells, and races to items. Plus, we'll be defining some of these cards during the session in case you want that +9 knife of ogre slaying or enjoy casting magic missile at the darkness.\n\nThis workshop is language agnostic and for all levels of developers. The focus is on TDD and emergent design but pair programming will be covered as well. The only requirement is that you bring a laptop and that you be able to test-drive you code with your language of choice. When you are done you will emerge a better programmer for the experience but there is small chance you will have a craving for Cheetos and Mountain Dew.",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Guy Royse",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Putting-the-DD-in-TDD--FULL-DAY",
    "EventType": "PreCompiler",
    "Id": "7aadb2f7-7bd4-432f-a351-a1f4c1d6d4ca",
    "SessionLookupId": "Putting-the-DD-in-TDD--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Guy-Royse"
  },
  {
    "Title": "Python Through the Back Door",
    "Abstract": "At Netflix, developers figure out what tools and languages make sense for them to use to solve problems.  At the same time, two years ago there was a huge amount of infrastructural support for Java (and other JVM-based languages), and none for Python.  In this talk, I'll go over the motivations I had for having Python supported as a first-class language in the Netflix cloud environment, the process of driving that support, and the outcome two years later.",
    "Difficulty": "Beginner",
    "SpeakerName": "Roy Rapoport",
    "Technology": "Languages",
    "URI": "/api/sessions.json/Python-Through-the-Back-Door",
    "EventType": "Session",
    "Id": "c4f39c80-da76-4deb-ab87-de97fabad4f1",
    "SessionLookupId": "Python-Through-the-Back-Door",
    "SpeakerURI": "/api/speakers.json/Roy-Rapoport",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Rails with a Clojure twist",
    "Abstract": "We've all seen what happens when simple rails applications powering startups grow into full featured web applications with millions of users. The features keep getting tacked on until it's nearly impossible to follow the code and ActiveRecord hacks make it almost impossible to upgrade. Over the course of 6 months myself and one other developer built a full featured web application written in Clojure. It was an extremely eye opening experience that showed me a lot of ways that I can improve those kinds of rails applications. In this talk I'll go over some of those techniques and show you how they can help in your applications as well.",
    "Difficulty": "Intermediate",
    "SpeakerName": "David Pick",
    "Technology": "Ruby / Rails",
    "URI": "/api/sessions.json/Rails-with-a-Clojure-twist",
    "EventType": "Session",
    "Id": "dd741cd9-8359-4567-991e-69266d889a6b",
    "SessionLookupId": "Rails-with-a-Clojure-twist",
    "SpeakerURI": "/api/speakers.json/David-Pick",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Real JavaScript Ninjas know how to role with WAI-ARIA",
    "Abstract": "WAI-ARIA's role and aria-* attributes allow rich Internet applications to be made accessible - no exceptions. There are however some undocumented tricks and techniques to make this work across multiple mobile and desktop platforms.\n\nThis presentation will give an overview of all the ARIA roles and their related aria-* attributes with working code samples for some advanced ARIA widgets and then cover a range of undocumented cross-platform tricks that are required to make things work well on every platform.\n\nThis session will assume advanced HTML and JavaScript knowledge from attendees.",
    "Difficulty": "Advanced",
    "SpeakerName": "Dylan Barrell",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Real-JavaScript-Ninjas-know-how-to-role-with-WAIARIA",
    "EventType": "Session",
    "Id": "7f701486-d03d-4577-970a-965d4cdd0a7a",
    "SessionLookupId": "Real-JavaScript-Ninjas-know-how-to-role-with-WAIARIA",
    "SpeakerURI": "/api/speakers.json/Dylan-Barrell",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "Real World Polyglot Persistence",
    "Abstract": "It always sounds easy - \"use the best tool for the job\". With very isolated systems, it's easy to decide RDBMS for one application, Redis for another and Cassandra for somethings else. When it comes time to building systems with multiple persistent stores, we're met with challenges in integration, existing applications, and push back from IT administrators.\nIn this session, we'll look at the multitude of challenges of achieving polyglot persistence nirvana, and strategies for addressing associated risks. We'll journey through an exploration of a working system that combines relational, key-value, document and graph databases without falling to its knees in complexity. With strategies like REST, messaging, service buses and compositional user interfaces, we'll find how amazingly complex websites like Amazon are within reach by us mere mortals.",
    "Difficulty": "Advanced",
    "SpeakerName": "Jimmy Bogard",
    "Technology": "Windows / .NET",
    "URI": "/api/sessions.json/Real-World-Polyglot-Persistence",
    "EventType": "Session",
    "Id": "a3e67cf9-e39a-4af2-834a-6c26c5b223d6",
    "SessionLookupId": "Real-World-Polyglot-Persistence",
    "SpeakerURI": "/api/speakers.json/Jimmy-Bogard",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Rust for $LANGUAGE-ists",
    "Abstract": "Rust is a new programming language from Mozilla. I think its super rad, but I basically program in Ruby all day. Bummer, right?\n\nNo! Thats not right! Just because I use one language for work doesnt mean I need to forsake all others. In fact, its often good to check out what other languages have to offer. It even might help you write better code in your usual language.\n\nThis talk will introduce you to Rust, and show you the three things that make it awesome: concurrency, safety, and speed. We'll compare Rust's approach with other languages', and see what lessons we can take home.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Steve Klabnik",
    "Technology": "Other",
    "URI": "/api/sessions.json/Rust-for-LANGUAGEists",
    "EventType": "Session",
    "Id": "4aec00c3-de82-4399-8aa5-4d6a21ae76fb",
    "SessionLookupId": "Rust-for-LANGUAGEists",
    "SpeakerURI": "/api/speakers.json/Steve-Klabnik",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Scala for Java developers",
    "Abstract": "Scala is a general-purpose programming language that runs on Java Virtual Machine (JVM). But the recent explosion of programming languages on JVM raises a question that every developer faces today: which programming language to learn next? Which languages are ready for mainstream development? Among the heap of programming languages why should you learn Scala?\n\nFor this presentation I will focus on 10 Scala features and I am sure they will be enough to convince you that Scala should be your next language.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Nilanjan Raychaudhuri",
    "Technology": "Languages",
    "URI": "/api/sessions.json/Scala-for-Java-developers",
    "EventType": "Session",
    "Id": "2a1be77d-ca65-4924-8afd-ca105a7b63df",
    "SessionLookupId": "Scala-for-Java-developers",
    "SpeakerURI": "/api/speakers.json/Nilanjan-Raychaudhuri",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Scaling Your Data Safely for Fun and Profit with Riak!",
    "Abstract": "Does Caching get you down? Can your database survive a nuclear blast or the zombie holocaust?  Can you scale your database to keep up with demand without writing to /dev/null ?  If you said yes to any of the above, then Riak may be for you.  \n\nIn this session, we'll introduce you to Riak, a highly available distributed database.  We will cover the concepts behind Riak, how to code against it in .Net/Ruby, how to scale it, and how to keep your data safe in the event of a natural disaster/AWS outage. \n\nThis session is for senior developers and those interested in NoSql solutions.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Alex Moore",
    "Technology": "Other",
    "URI": "/api/sessions.json/Scaling-Your-Data-Safely-for-Fun-and-Profit-with-Riak",
    "EventType": "Session",
    "Id": "0e7af3a6-ae48-49b7-abb0-91c9dc392688",
    "SessionLookupId": "Scaling-Your-Data-Safely-for-Fun-and-Profit-with-Riak",
    "SpeakerURI": "/api/speakers.json/Alex-Moore",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Scary And Amazing Security Things That Will Keep You Up At Night -- HALF DAY",
    "Abstract": "Many developers hate to think about security... the security guys are the ones always telling you that you can't spend time working on the new feature you really care about because you must finish your threat model. They are the guys that \"ruin\" your end-user experience by making you require complex passwords and other security \"features\" that seem to cause more headache than they are worth.\n\nIn this session, we'll explore a handful of security topics from a developer's perspective. We will look at some of the ways current attackers are \"hiding in plain sight\" and avoiding your cyber defenses. We'll spend some time looking at just how strong your passwords are, and if it matters. We'll look a bit at software defined radio (SDR) and why it is an important addition to a pen-tester's toolkit. Finally, we'll talk some about the future of defenses and have an open discussion on how one might secure oneself in an information leaky environment.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-07T17:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Rob Gillen",
    "Technology": "Other",
    "URI": "/api/sessions.json/Scary-And-Amazing-Security-Things-That-Will-Keep-You-Up-At-Night--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "404c5741-dd65-42b6-a02b-6d56ecaa15d1",
    "SessionLookupId": "Scary-And-Amazing-Security-Things-That-Will-Keep-You-Up-At-Night--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Rob-Gillen"
  },
  {
    "Title": "Scratching the Surface with JavaFX",
    "Abstract": "User interfaces are becoming increasingly less mouse-centric, in favor of multi-touch input. In addition, UIs are increasingly incorporating 3D components.  This session will teach the audience how to develop multi-touch applications using Java/JavaFX, and how to use the JavaFX 3D API and lambda expressions in JDK 8.  This presentation consists mostly of code snippets, and demos running on a Surface Windows 8 Pro.\n\n\nMulti-touch Programming with Java/JavaFX\n- Implementing Touch Gestures\n- Understanding Touch Events and Touch Points\n- Using the Pagination Control\n- Accommodating Fingers\n\nDeveloping 3D Applications with Java/JavaFX\n\nExamining an Example of Multi-touch Application: ZenGuitar3D",
    "Difficulty": "Beginner",
    "SpeakerName": "Jim Weaver",
    "Technology": "Java",
    "URI": "/api/sessions.json/Scratching-the-Surface-with-JavaFX",
    "EventType": "Session",
    "Id": "f74700f7-0c68-4ce9-9074-7d964e9bd030",
    "SessionLookupId": "Scratching-the-Surface-with-JavaFX",
    "SpeakerURI": "/api/speakers.json/Jim-Weaver",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Scrum Workshop -- HALF DAY",
    "Abstract": "Abstract forthcoming.\n\nCome learn how bringing Scrum to your organization can help you deliver more value to your customers.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T17:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Alexei Govorine",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Scrum-Workshop--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "ec679943-38db-439a-80c8-75f49f4ca17e",
    "SessionLookupId": "Scrum-Workshop--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Alexei-Govorine"
  },
  {
    "Title": "Searching for the Masses with ElasticSearch",
    "Abstract": "Search is the touchstone of the Internet; without it, the Internet wouldn’t be all that useful. But search hasn’t always been that easy nor affordable to implement. That's where ElasticSearch shines. ElasticSearch adds not only a simple API for adding and searching content, but does it in a distributed manner. With infinitesimal arm grease, you can set up a search cluster that smears your data and resultant queries across a series of nodes. Not only is this resultant architecture fast, but it’s easy to set up and extremely affordable as search nodes can run on commodity hardware. \n\nIn this session, I'll show you how to get up and running with ElasticSearch. You'll learn how to create a cluster, how to index and search documents via its RESTful API and how to use a few handy client libraries. You'll be bringing search to the masses in no time!",
    "Difficulty": "Beginner",
    "SpeakerName": "Andrew Glover",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Searching-for-the-Masses-with-ElasticSearch",
    "EventType": "Session",
    "Id": "d4c79cf4-8f3e-4569-8c8d-1ae6061731f7",
    "SessionLookupId": "Searching-for-the-Masses-with-ElasticSearch",
    "SpeakerURI": "/api/speakers.json/Andrew-Glover",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Secrets of Clojure Web Development",
    "Abstract": "Clojure is an exciting language because of its ease of concurrency, simplicity, and aptitude at data manipulation. What's not as well known is how great of a language it is for web development.\n\nIn this session, we're going to cover how you can use Clojure and ClojureScript to simplify and unify server-side and client-side code, and talk about how to build modern web applications in Clojure. We'll move beyond trivial CRUD apps and get into WebSockets, streaming, and WebMachine-style resource serving.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Clinton Dreisbach",
    "Technology": "Languages",
    "URI": "/api/sessions.json/Secrets-of-Clojure-Web-Development",
    "EventType": "Session",
    "Id": "bb316acf-60d6-4029-8806-72fb70f7a1db",
    "SessionLookupId": "Secrets-of-Clojure-Web-Development",
    "SpeakerURI": "/api/speakers.json/Clinton-Dreisbach",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Serenity for Android: Lessons learned about designing an app for Google TV",
    "Abstract": "Making sure your Android app runs across a multitude of mobile devices can be challenging.  You have a wide variety of screen sizes to deal with, battery usage concerns, wifi availability, and cellular\ndata capacity to contend with. Add in tablets and the various display sizes and challenges increase. Now toss in televisions and the various smart tv Android sticks, and you have yet another interface\npoint to deal with.  A remote control or game controller as the primary input. With Google TV and smart TV sticks, the user experience is a 10 foot experience, meaning you need to keep this in mind as well.\n\nHow can you design an app that works well on both, but still provide an optimized experience. In this session, we'll look at the design and user interface challenges faced. Just using a tablet interface\noptimized for a touch layout is not an ideal user experience when the app is on a TV screen.\n\nWe'll cover such things as:\n\n* Android layouts design patterns\n* Optimizing the app for use with a remote or game controller\n* Image and video playback issues and advantages\n* Designing your app for accessibility\n* Should you be concerned about wifi usage?\n* Retrieving data from the cloud",
    "Difficulty": "Intermediate",
    "SpeakerName": "David Carver",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Serenity-for-Android-Lessons-learned-about-designing-an-app-for-Google-TV",
    "EventType": "Session",
    "Id": "7942dcd5-e37d-46fd-9bfe-ef50fa0a4841",
    "SessionLookupId": "Serenity-for-Android-Lessons-learned-about-designing-an-app-for-Google-TV",
    "SpeakerURI": "/api/speakers.json/David-Carver",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Setting up your environment for the AWS Cloud -- HALF DAY",
    "Abstract": "We want you to leave CodeMash with a working cloud account, including supporting infrastructure that Amazon DOESN’T provide but that will make your cloud life way more manageable! We’ll help you set up your own account (if you need to), get Asgard running for deployment, show you how to configure the Simian Army (monkeys!) for resiliency, and Ice for monitoring your cloud spend.  If you attended the morning session (Architecting the Cloud), this will give you the opportunity to put what you learned into your own account for continued exploration. But even if you aren’t using NetflixOSS, this workshop will be meaningful for anyone getting started with or currently using AWS.",
    "Start": "2014-01-08T18:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Joe Sondow",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Setting-up-your-environment-for-the-AWS-Cloud--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "2cfb867c-3518-49fd-9c35-b00820a7ffb0",
    "SessionLookupId": "Setting-up-your-environment-for-the-AWS-Cloud--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Joe-Sondow"
  },
  {
    "Title": "Show an Open Source Project Some Love and Start Using Travis-CI",
    "Abstract": "Lots of us are looking for an open source project to help with, but sometimes it is hard to find a way to contribute. I'd like to recommend that folks start to consider using Travis-CI and adding Travis-CI scripts to projects that don't already have them. Lets look at what it takes to build a project using Travis and the benefits that a project can take advantage of if they use the service.",
    "Difficulty": "Beginner",
    "SpeakerName": "Joel Byler",
    "Technology": "Testing",
    "URI": "/api/sessions.json/Show-an-Open-Source-Project-Some-Love-and-Start-Using-TravisCI",
    "EventType": "Session",
    "Id": "96ba15eb-4b7b-42a8-90db-baec2e6a8bc9",
    "SessionLookupId": "Show-an-Open-Source-Project-Some-Love-and-Start-Using-TravisCI",
    "SpeakerURI": "/api/speakers.json/Joel-Byler",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Simply JavaScript",
    "Abstract": "“When you stop expecting people to be perfect, you can like them for who they are.” - Donald Miller\n\nJavaScript is a pretty awesome language. I hear that I’m in the minority with this opinion. I wouldn’t know, I’m not much of a joiner, but if folks don’t love this little language for what it is, it’s a fair assumption they probably hate it for what it is not.  That makes sad panda sad. Let’s get to know JavaScript a little for what it is. We’ll celebrate Functions, Scope, Prototypes and the royal “this”. JavaScript’s loose boundaries mean that it will be anything you want it to be. Let’s see what happens when we simply let it be JavaScript.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Leon Gersing",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Simply-JavaScript",
    "EventType": "Session",
    "Id": "14636ee4-bf62-45e6-8bb8-e6750688ddbf",
    "SessionLookupId": "Simply-JavaScript",
    "SpeakerURI": "/api/speakers.json/Leon-Gersing",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Single-Page App Architecture",
    "Abstract": "In this talk, we will survey the landscape of techniques for building single-page web applications, for fun, profit, and most importantly, perceived performance. Compared to a traditional site with page refreshes for navigation and actions, single-page apps introduce complexity around state management, client-server synchronization and memory usage, and often increase initial page load time. Learn how to minimize the spinner and make your site feel responsive and continuous.\n\nInstead of focusing on a particular server or client-side framework, we will lay out pros and cons of strategies for serving assets, passing data, shared templating and code, caching and managing dependencies, referencing tools that can help along the way. You will leave this session knowing how to evaluate the different approaches and decide what is right for your project.\n\n----------------\n\npresented at a local meetup: https://github.com/afeld/spaa",
    "Difficulty": "Intermediate",
    "SpeakerName": "Aidan Feldman",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/SinglePage-App-Architecture",
    "EventType": "Session",
    "Id": "8c478bf1-eef3-4372-95ca-29c725fd373e",
    "SessionLookupId": "SinglePage-App-Architecture",
    "SpeakerURI": "/api/speakers.json/Aidan-Feldman",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Sneaking Scala through the Back Door",
    "Abstract": "Is your organization committed to the power of the Java platform but stuck in the Java language? Do you spend your time wishing you could use Scala at work, but don’t see how you can get it approved?\n\nThere are good reasons to push for it! Scala is a popular language with Java developers because of its expressiveness and lack of boilerplate code. It allows you to focus on the problem rather than the ceremony required by Java. Yet, businesses are often reluctant to move to Scala, citing concerns about availability of developers and risks of working in a new language.\n\nLearn strategies for bringing Scala into your organization, including using it in non-production code, integrating Scala into a Java application, and easing your fellow programmers into functional programming. See how to use Scala for new development while maintaining your investment in existing Java code. Hear stories of how other organizations have done this and succeeded. You’ll leave knowing how you can move to Scala without risking your job or the success of your projects.",
    "Difficulty": "Beginner",
    "SpeakerName": "Dianne Marsh",
    "Technology": "Languages",
    "URI": "/api/sessions.json/Sneaking-Scala-through-the-Back-Door",
    "EventType": "Session",
    "Id": "6aaedfc9-295c-4a56-8e71-e1d09da554b1",
    "SessionLookupId": "Sneaking-Scala-through-the-Back-Door",
    "SpeakerURI": "/api/speakers.json/Dianne-Marsh",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "SOLID JavaScript In A Wobbly World (wide web)",
    "Abstract": "Robert (\"Uncle Bob\") Martin compiled a handful of principles in to a convenient acronym back in the 90's. These principles, the Single Responsibl.. *SNORE, COUGH, wiping drool from chin*... Huh? What? SNOOZEFEST, Right? Why should you care about some ancient set of principles from static languages and arcane compilers when you're building JavaScript? You've got Backbone, Ember and Angular as your safety net, right? Yeah. Right. That's like driving in to your local auto mechanic shop and telling them you just need to borrow their tools for a bit so you can re-engineer your car. Good luck with that.\n\nYou want to write clean, maintainable code. You want your Backbone, Ember and Angular apps to be the stuff of legend. You want to brag about how you restructured 3 screens of heavy business logic in 15 minutes instead of 3 days like you thought it would take. You want to write code from principles and rock-SOLID foundations, from which you can expand and grow as a developer. Come learn about one set of principles that will get down that path, see why they are not what you think they are, and learn how they apply them to JavaScript.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Derick Bailey",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/SOLID-JavaScript-In-A-Wobbly-World-wide-web",
    "EventType": "Session",
    "Id": "c38c4a8a-a255-4ca9-adcc-5a2dcfa93937",
    "SessionLookupId": "SOLID-JavaScript-In-A-Wobbly-World-wide-web",
    "SpeakerURI": "/api/speakers.json/Derick-Bailey",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Speaker Workshop -- FULL DAY (but in two parts)",
    "Abstract": "AM session: \nIn this session we'll cover the core concepts around creating abstracts, developing materials, formulating slide decks and presentation techniques. This session will have some participation (not required) but is largely informative. \n\nAfternoon Session: \nIn this session we will be doing a master-class style workshop of YOUR materials. Bring your talks, if you have presented them once or a thousand times and we will run an Opera style master class on your material. This is a session that you'll want to prepare for ahead of time. If you're interested in how to take your talks to the next level, this is the session for you. Visitors are welcome to watch and encouraged to be brave and participate.",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Leon Gersing",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Speaker-Workshop--FULL-DAY-but-in-two-parts",
    "EventType": "PreCompiler",
    "Id": "fb05286e-c569-4f06-b343-a1520e532336",
    "SessionLookupId": "Speaker-Workshop--FULL-DAY-but-in-two-parts",
    "SpeakerURI": "/api/speakers.json/Leon-Gersing"
  },
  {
    "Title": "Startup Tips and Tricks: Getting a small IT shop off the ground",
    "Abstract": "Are you a developer interested in becoming an independent consultant? Do you have a great software idea and have thought about starting your own software company? In this presentation Kevin will talk about his journey from the corporate world to being an independent consultant and through owning a small consulting firm. We will cover all aspects of business ownership from where to find the right technology and how to find partners such as legal and accounting help. You may find it fascinating that a small company actually has the opportunity to have the same (if not better) IT infrastructure than most large enterprises for a fraction of the cost.",
    "Difficulty": "Beginner",
    "SpeakerName": "Kevin Grossnicklaus",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Startup-Tips-and-Tricks-Getting-a-small-IT-shop-off-the-ground",
    "EventType": "Session",
    "Id": "151356d8-45ef-4faa-9651-2ccc847905d3",
    "SessionLookupId": "Startup-Tips-and-Tricks-Getting-a-small-IT-shop-off-the-ground",
    "SpeakerURI": "/api/speakers.json/Kevin-Grossnicklaus",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Streamlining Development To Deployment with Docker",
    "Abstract": "Have you ever been frustrated by how difficult it is to introduce a new service or technology to your stack? Have you ever been burned by complex deployment processes that lead to failing features? Do you often catch yourself saying, “But it worked on my machine!(tm)”?\nDocker uses a Linux Kernel feature that allows you to create self-contained applications and services and ship them between environments in a secure and reliable way. Come and learn how you can start using Docker to build light-weight containers and simplify the way your code goes from development to production.",
    "Difficulty": "Advanced",
    "SpeakerName": "Alex Robson",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Streamlining-Development-To-Deployment-with-Docker",
    "EventType": "Session",
    "Id": "1639bc6b-b354-4d58-85ef-9ef61ebcdb1b",
    "SessionLookupId": "Streamlining-Development-To-Deployment-with-Docker",
    "SpeakerURI": "/api/speakers.json/Alex-Robson",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Surviving Support: 10 Tips for Saving Your Users and Yourself",
    "Abstract": "When I open sourced my plugin to the WordPress community, user support was one of the last things on my mind - I was more excited to have written awesome code and a helpful site extension. Shortly thereafter though, customer support was the only thing I had time for.  When your user base ranges in skill level from experienced developer to your grandmother, well… you've gotta be prepared for just about anything.  This session will highlight the challenges and benefits of stellar support and offer a few tricks to make the process as painless as possible for both your user and yourself.",
    "Difficulty": "Beginner",
    "SpeakerName": "Julie Cameron",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Surviving-Support-10-Tips-for-Saving-Your-Users-and-Yourself",
    "EventType": "Session",
    "Id": "c143a44a-a25f-40ad-bde0-fe4fbf6a5f4e",
    "SessionLookupId": "Surviving-Support-10-Tips-for-Saving-Your-Users-and-Yourself",
    "SpeakerURI": "/api/speakers.json/Julie-Cameron",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Sweet Elixir!  A Gentle Introduction to Erlang’s cute younger brother Elixir -- FULL DAY",
    "Abstract": "Around 60% of telecom passes through Erlang.  It’s fast, concurrent, distributed, but its Prolog-inspired syntax leaves much to be desired.  Ruby is beautiful and powerful, but struggles at scale and treats concurrency as a second class citizen.  Elixir - a young, functional, meta programming language - aims to resolve this mighty conflict by providing a rosy syntax inspired by Ruby that compiles to Erlang VM compatible bytecode.\n\nTogether we’ll take a guided tour of Elixir basics and functional programming concepts like pattern matching, pipelines and tail-call recursion.  From there we’ll explore the distributed and concurrent nature of Elixir, the fault tolerant nature of OTP, and leverage existing Erlang modules.\n\nYou scoff at the lack of angle brackets or curly braces?!  \"Where are my webs\" you ask?!  We’ll explore the Rails inspired web framework Dynamo and ActiveRecord-esque Atlas created by co-presenter Chris McCord.\n\nWhether you roll with a Mac, Windows or Linux we’ll get you up and coding with a fully functioning Erlang and Elixir development environment.  Everyone will leave as an Elixir programmer.",
    "Start": "2014-01-08T13:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Ryan Cromwell",
    "Technology": "Languages",
    "URI": "/api/sessions.json/Sweet-Elixir--A-Gentle-Introduction-to-Erlangs-cute-younger-brother-Elixir--FULL-DAY",
    "EventType": "PreCompiler",
    "SecondarySpeakerName": "Chris McCord",
    "SecondarySpeakerBio": "You can find Chris on Twitter as @chris_mccord",
    "Id": "e97ee33e-91d4-471e-b0ef-1e4fe167bc90",
    "SessionLookupId": "Sweet-Elixir--A-Gentle-Introduction-to-Erlangs-cute-younger-brother-Elixir--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Ryan-Cromwell"
  },
  {
    "Title": "Team Collaboration",
    "Abstract": "After working independent for the past 8 years, I have seen a few things that\nwent good and quite a few that have not. When things break down, it's almost\nalways due to poor communication.\n\nIt doesn't have to be like this.\n\nWe'll discuss the mindsets of everyone involved with seeing a project succeed\nand what tools or techniques can help to fill the communication gap.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jonathan Knapp",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Team-Collaboration",
    "EventType": "Session",
    "Id": "3aaddd96-6d5a-419d-b1d9-993e6eefcc7c",
    "SessionLookupId": "Team-Collaboration",
    "SpeakerURI": "/api/speakers.json/Jonathan-Knapp",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Test All The (CSS) Things! Making CSS testing less painful and more reliable",
    "Abstract": "Visually testing user interfaces can be a serious pain.  Issues are difficult to pin down due to browser rendering quirkiness.  Most of us rely on manual testing to ensure that our pages look they way they should; this is time-consuming, fraught with human error, and not always the most reliable (or reliably reproducible) form of testing.\n\nWe can do better! From automated code validation and style guide adherence checking to CSS verification tests, we'll discuss the most successful tools to help you get to production with fewer bugs and more consistency.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Tina Bell Vance",
    "Technology": "Design/UX",
    "URI": "/api/sessions.json/Test-All-The-CSS-Things-Making-CSS-testing-less-painful-and-more-reliable",
    "EventType": "Session",
    "Id": "d226b440-c3aa-490e-bdbe-c3ba27439dfb",
    "SessionLookupId": "Test-All-The-CSS-Things-Making-CSS-testing-less-painful-and-more-reliable",
    "SpeakerURI": "/api/speakers.json/Tina-Bell-Vance",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Test Driven Node.js -- HALF DAY",
    "Abstract": "Node.js is the latest of a number of technologies to reach wide adoption without truly leveraging good practices for testing. Our eagerness for playing with new and shiny toys in the apps that we build should not be oppressed, but we must recognize that the applications that we build with little forethought towards proper testing and craft will have an extremely limited lifespan and may even jeopardize our efforts to get technologies adopted in a broader sense.\n\nAt Test Double, we have helped a couple of clients to move towards a more test driven approach to developing Node.js based applications and we are eager to share both the tools and techniques that we’ve seen succeed in this space. This talk will leverage tools like Jasmine, Grunt, Sandboxed Module, Istanbul and a bevy of practices that will allow developers to create Node.js applications with a Test Driven Approach.",
    "Start": "2014-01-08T18:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Todd Kaufman",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/Test-Driven-Nodejs--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "0cf4f3a9-08f5-40c0-82a4-419b8c98ad93",
    "SessionLookupId": "Test-Driven-Nodejs--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Todd-Kaufman"
  },
  {
    "Title": "Testing Web Services",
    "Abstract": "This session will cover various tools, frameworks and techniques for testing Web Services.  We will take SoapUI, JMeter and REST-assured for a spin, and discuss how they may suit for smoke testing, load testing, performance testing, acceptance testing, probing and mocking Web Services.  Examples will include SOAP and RESTful Web Services using XML and JSON.  Some general tips will be provided on Web Service development.  There will be some code examples in Java, but the session should benefit anyone struggling with Web Service testing.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Stan Jónsson",
    "Technology": "Testing",
    "URI": "/api/sessions.json/Testing-Web-Services",
    "EventType": "Session",
    "Id": "28a3f7a2-9914-490a-ac36-41aaa169e62c",
    "SessionLookupId": "Testing-Web-Services",
    "SpeakerURI": "/api/speakers.json/Stan-Jónsson",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "The Birth and Death of Javascript",
    "Abstract": "This talk traces JavaScript's impact on software development tools over forty years, from 1995 until 2035. Although the language is mostly dead today, it drove the largest transformation of mainstream development tools since the creation of Unix 65 years ago.\n\nWe'll examine some key moments in JavaScript's history: its accidental rise to popularity; asm.js, allowing arbitrary software to run at native speed in browsers; the language ecosystem that grew up around asm.js, displacing JavaScript itself; the replacement of traditional Unix terminals, shells, and editors with new, higher-level equivalents running against the DOM; and finally, the inversion of the browser-OS relationship, still ongoing.\n\nThis story is told by someone who was a fervent JavaScript detractor during its rise. It was easy to see the language's numerous and glaring shortcomings, but miss the path that it laid out.",
    "Difficulty": "Advanced",
    "SpeakerName": "Gary Bernhardt",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/The-Birth-and-Death-of-Javascript",
    "EventType": "Session",
    "Id": "fce4d749-a74a-4271-9021-c7e157c3aee5",
    "SessionLookupId": "The-Birth-and-Death-of-Javascript",
    "SpeakerURI": "/api/speakers.json/Gary-Bernhardt",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "The DOM is not your application",
    "Abstract": "Most client-side JavaScript interacts with the DOM, which is a wonderful abstraction that lets us interact with the browser.\n\nUnfortunately, a lot of that DOM interaction is strewn across the JavaScript code any old place it happens to fall, making the code hard to understand and hard to update.\n\nThe DOM is actually a third party dependency, and should be treated like one. By interacting with the DOM via a wrapper in your own code, you make your code easier to read, test, and update.\n\nWe'll look at an example of refactoring code from standard JavaScript/jQuery with DOM references everywhere, to an approach where the DOM references are isolated. At the end of this talk, you'll see how isolating the DOM leads to better client-side code.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Noel Rappin",
    "Technology": "JavaScript",
    "URI": "/api/sessions.json/The-DOM-is-not-your-application",
    "EventType": "Session",
    "Id": "23c098fe-51a0-43d7-b5e2-f82578bc542c",
    "SessionLookupId": "The-DOM-is-not-your-application",
    "SpeakerURI": "/api/speakers.json/Noel-Rappin",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "The Future of C#",
    "Abstract": "See the future now! For the past several years, the C# team has been focused on rebuilding the compilers and editing experiences as part of Project Roslyn. This effort has paved the way for C# to continue evolving for many years to come. However, what does that future actually look like? In this action-packed session with C# team members, we’ll gaze into our crystal ball and get a glimpse of potential new C# language features, take a ride through the future C# editing experience, and explore the power of the Roslyn APIs to interact with C# source code. This is a session that you won’t want to miss!",
    "Difficulty": "Intermediate",
    "SpeakerName": "Dustin Campbell",
    "Technology": "Languages",
    "URI": "/api/sessions.json/The-Future-of-C",
    "EventType": "Session",
    "Id": "7356af5f-3151-4ecf-95dc-1d42b1149758",
    "SessionLookupId": "The-Future-of-C",
    "SpeakerURI": "/api/speakers.json/Dustin-Campbell",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "The Lean Creative Conference Experiment -- HALF DAY",
    "Abstract": "Participants in this fun and interactive workshop will see how the skills of an improviser relate directly to Agile and Lean methodologies. By coming up with a business idea centered around CodeMash, they will learn the art of team collaboration, seeing mistakes as opportunities, rapid prototyping, reframing problems, effective communication, discovery, and presenting their findings to the group.",
    "Start": "2014-01-08T18:30:00Z",
    "End": "2014-01-08T22:30:00Z",
    "Difficulty": "Beginner",
    "SpeakerName": "Jessie Shternshus",
    "Technology": "Soft Skills",
    "URI": "/api/sessions.json/The-Lean-Creative-Conference-Experiment--HALF-DAY",
    "EventType": "PreCompiler",
    "Id": "e5c6bef4-c6ef-4c5d-9993-b4354f8e13fb",
    "SessionLookupId": "The-Lean-Creative-Conference-Experiment--HALF-DAY",
    "SpeakerURI": "/api/speakers.json/Jessie-Shternshus"
  },
  {
    "Title": "The Low Risk Entrepreneur",
    "Abstract": "You don't have to quit your day job to be an entrepreneur.  In this session, serial (and often parallel) entrepreneur Steve Smith will talk about ways developers (and others) can launch their own businesses from the comfort of their existing full time positions, often with the full support of their employers.  It's never been easier or cheaper to start a business, and whether you just have an idea you want to try out or you're hoping to augment your income and resume with some accomplishments outside of your current workplace, running and growing your own business can be very rewarding.\n\nIn this session, we'll talk about various kinds of opportunities and the commitments they require, employment agreement considerations, how to align your goals with your business, and how the low-risk option differs from the traditional startup approach.  Questions and discussion will of course be welcome as well.",
    "Difficulty": "Beginner",
    "SpeakerName": "Steve Smith",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/The-Low-Risk-Entrepreneur",
    "EventType": "Session",
    "Id": "d1d79bf8-1d10-43ba-9891-f8f3c6975351",
    "SessionLookupId": "The-Low-Risk-Entrepreneur",
    "SpeakerURI": "/api/speakers.json/Steve-Smith",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "The Right Amount Of Planning",
    "Abstract": "With agile projects, finding the balance of planning can be a difficult balance. Plan too much, and when things change (and they will) your time was wasted. However, if you plan too little, you may end up going off in the wrong direction. In this session, we will discuss what the right amount of planning is to get you started, but how to avoid doing so much that you are wasting your time.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jonathan Mills",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/The-Right-Amount-Of-Planning",
    "EventType": "Session",
    "Id": "b24ff118-255b-4f33-ae67-92b232d63a90",
    "SessionLookupId": "The-Right-Amount-Of-Planning",
    "SpeakerURI": "/api/speakers.json/Jonathan-Mills",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "The Test Driven Developers Android Testing Toolbox",
    "Abstract": "Practicing test driven development with the Android framework can be challenging. There are tools to help, but each comes with its own set of strengths and limitations. Knowing which tool best suites a particular situation can often prove difficult.\n\nDuring this session we'll take an objective look at some of the options Android developers have available for practicing test driven development. \n\nWe'll cover several open source tools that have proven useful as well as some of the tools available within the Android framework itself.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Dave Shah",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/The-Test-Driven-Developers-Android-Testing-Toolbox",
    "EventType": "Session",
    "Id": "45325756-2232-46fc-8d1e-ce05cebb1927",
    "SessionLookupId": "The-Test-Driven-Developers-Android-Testing-Toolbox",
    "SpeakerURI": "/api/speakers.json/Dave-Shah",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Tooling and Improving Web Performance",
    "Abstract": "Web performance is a fairly well-researched subject; a quick search for \"Google PageSpeed\" renders a list of performance improvements you can make to decrease load time. However, keeping track of web performance is more involved than a quick refresh-and-watch-the-network-pane dance; in order to really track what improvements you've made, it's helpful to use other tools. I'll cover how using tools like NewRelic, WebPageTest, and PageSpeed can help you uncover and log performance improvements, and build a terrible Rails demo so you can try out changes on your own time.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Jack Lawson",
    "Technology": "Other",
    "URI": "/api/sessions.json/Tooling-and-Improving-Web-Performance",
    "EventType": "Session",
    "Id": "b952c214-aa11-4bd5-85e3-76dd9044ce8f",
    "SessionLookupId": "Tooling-and-Improving-Web-Performance",
    "SpeakerURI": "/api/speakers.json/Jack-Lawson",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Transform Your Architecture With RabbitMQ",
    "Abstract": "Common 2 and 3 tier architectures have several disadvantages: they don’t scale well over time, they can be difficult to evolve, expensive to test, locked into a limited set of tools and unpleasant to maintain.\nRabbitMQ provides a well designed set of messaging capabilities that enable decoupled architecture and transform a system into a set of simple, powerful services that can easily evolve to satisfy new requirements, leverage the best technology, scale out to handle increased load and gracefully recover from failures.\nThis talk will explore how to apply messaging patterns and advanced features of RabbitMQ to create flexible, resilient and scalable systems.",
    "Difficulty": "Advanced",
    "SpeakerName": "Alex Robson",
    "Technology": "Other",
    "URI": "/api/sessions.json/Transform-Your-Architecture-With-RabbitMQ",
    "EventType": "Session",
    "Id": "1b1b2579-c1d3-4452-acb2-8d630a0e71ff",
    "SessionLookupId": "Transform-Your-Architecture-With-RabbitMQ",
    "SpeakerURI": "/api/speakers.json/Alex-Robson",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Trending toward Next-Gen Application Performance through Lifecycle Monitoring",
    "Abstract": "The longer we put off testing, the more likely it is that we face unpleasant surprises when we can least afford them, especially when it is critical to deliver a well-performing application, on-time, the first time. Scott Barber shares his latest work on how teams, particularly Agile teams, dramatically reduce the likelihood of unpleasant, late-stage performance surprises while concurrently reducing the time and effort needed to resolve unpleasant performance surprises when they do crop up by embracing a lifecycle monitoring mentality. He presents this mentality within an easy to understand and implement framework suitable for use either \"as-is\" or as a sound foundation upon which to develop your own, custom framework for delivering well performing applications. Best of all, this framework integrates seamlessly into what you do today with literally a few minutes of work to begin implementing, and even fewer minutes of effort to maintain and benefit. If delivering next-generation performance, faster, cheaper, easier, and more reliably than you can today intrigues you, this talk is for you.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Scott Barber",
    "Technology": "Testing",
    "URI": "/api/sessions.json/Trending-toward-NextGen-Application-Performance-through-Lifecycle-Monitoring",
    "EventType": "Session",
    "Id": "cf0a52a1-4f94-4c71-a817-99fb14d0a94a",
    "SessionLookupId": "Trending-toward-NextGen-Application-Performance-through-Lifecycle-Monitoring",
    "SpeakerURI": "/api/speakers.json/Scott-Barber",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "TypeScript for C# Developers",
    "Abstract": "Javascript is the assembly language for the web. Does that make TypeScript the  C# for the web? \nIt's too early to tell, but it's one of the paths developers and teams can choose to be more productive writing large-scale applications for the web. \nIn this session, we'll go through the basics of TypeScript syntax, and how to integrate TypeScript with common JavaScript libraries. You'll learn the basics of TypeScript, and have a basic understanding of the language.  You'll leave with the basic skills in TypeScript to continue your own learning of this new language.",
    "Difficulty": "Beginner",
    "SpeakerName": "Bill Wagner",
    "Technology": "Languages",
    "URI": "/api/sessions.json/TypeScript-for-C-Developers",
    "EventType": "Session",
    "Id": "736daf8c-83d7-4d90-aa98-fb7b3a40c2f3",
    "SessionLookupId": "TypeScript-for-C-Developers",
    "SpeakerURI": "/api/speakers.json/Bill-Wagner",
    "Start": "2014-01-10T14:30:00Z",
 	"End": "2014-01-10T15:30:00Z"
  },
  {
    "Title": "Understanding Objective-C Inside and Out",
    "Abstract": "How many times have you tried to debug something in Objective-C without really knowing *why* it works a certain way? Do you start sweating when Xcode throws linker errors your way, or when you have to mix ARC and non-ARC code? This talk will reveal how Objective-C works, what actually happens when your application is linked, and reveal what ARC is actually doing. Objective-C is a 30-year-old language, and it’s evolving faster than ever. We’ll look at the basics of the language, how properties and categories work, and cover advanced topics like creating classes at runtime, memory management and ARC, and tagged pointers. At the end of the talk, you’ll be able to diagnose issues with your app more quickly, dive into system components more readily, and have a better sense of why your code works.",
    "Difficulty": "Advanced",
    "SpeakerName": "Jeff Kelley",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Understanding-ObjectiveC-Inside-and-Out",
    "EventType": "Session",
    "Id": "1a3a2ae9-6dde-4d43-af4b-11bc79233e03",
    "SessionLookupId": "Understanding-ObjectiveC-Inside-and-Out",
    "SpeakerURI": "/api/speakers.json/Jeff-Kelley",
    "Start": "2014-01-09T14:45:00Z",
 	"End": "2014-01-09T15:45:00Z"
  },
  {
    "Title": "Un-integrated Development Environment",
    "Abstract": "Lets look at what it takes to do some of the things that an IDE normally does for you, and consider how some tools that work great outside of an IDE can help to make us less dependant on the large memory consuming software that we use to develop with. Remember how a lot of us learned how to code using a simple text editor and some command line tools? Well, those command line tools are still there and available for you to use in your scripts. A tool like guard can help to compile and test our code and growl will keep us notified of the current status of our build. There are lots of tricks that can be used for all languages from ruby on a Linux box to C# on Windows.  There is a simple life outside of the IDE!",
    "Difficulty": "Intermediate",
    "SpeakerName": "Joel Byler",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Unintegrated-Development-Environment",
    "EventType": "Session",
    "Id": "dae809cb-6885-4dbb-a146-b2d20eb46345",
    "SessionLookupId": "Unintegrated-Development-Environment",
    "SpeakerURI": "/api/speakers.json/Joel-Byler",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "Using MonoGame to Develop Games for All (or Nearly All) Platforms",
    "Abstract": "During this session, attendees will be provided an overview of the requirements for using MonoGame (and .NET) to build a simple game and have it run on many platforms nearly 100% the same code base. Demonstrations of this will be provided against both Mac and Windows platforms (including a Microsoft Surface and an iPad). We will discuss benefits and limitations of this approach, best practices for getting started on the right track, and will leave attendees with information on additional resources for putting these concepts into practice with their own applications. Most importantly, we will walk through a real, functioning application written in C# and show how multiple build configurations can be used to target many platforms. Mac/iOS platforms will be targeted by MonoDevelop/Xamarin.iOS while Windows platforms will be targeted with Visual Studio 2012 using Windows 8 pro. The app demonstrated will not be a simple “Pong” clone and will be a full platformer with touch integration.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Kevin Grossnicklaus",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Using-MonoGame-to-Develop-Games-for-All-or-Nearly-All-Platforms",
    "EventType": "Session",
    "Id": "ad6281aa-118d-4869-b7b3-bc66fe2a142c",
    "SessionLookupId": "Using-MonoGame-to-Develop-Games-for-All-or-Nearly-All-Platforms",
    "SpeakerURI": "/api/speakers.json/Kevin-Grossnicklaus",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Using NoSQL with JPA, EclipseLink and Java EE",
    "Abstract": "This session explores how NoSQL solutions like MongoDB, Cassandra, Neo4j, HBase and CouchDB can be used in a Java EE application with or without a JPA centric facade. Although the primary focus is on EclipseLink NoSQL, we will also cover Hibernate OGM, EasyCassandra, Morphia, etc as well as seeing how NoSQL can be used natively via basic CDI injection.",
    "Difficulty": "Beginner",
    "SpeakerName": "Reza Rahman",
    "Technology": "Java",
    "URI": "/api/sessions.json/Using-NoSQL-with-JPA-EclipseLink-and-Java-EE",
    "EventType": "Session",
    "Id": "72a409df-e4ce-4e23-92f3-343c51201694",
    "SessionLookupId": "Using-NoSQL-with-JPA-EclipseLink-and-Java-EE",
    "SpeakerURI": "/api/speakers.json/Reza-Rahman",
    "Start": "2014-01-10T18:45:00Z",
 	"End": "2014-01-10T19:45:00Z"
  },
  {
    "Title": "UX Antipatterns: Hidden User Traps in Sites and Apps",
    "Abstract": "Let’s face it, as designers we’ve all been guilty of carelessly adopting popular usability and design conventions from time to time. Usually, we get the benefit of someone else’s thoughtfulness and research - no effort required. Unfortunately, popular solutions to user interface problems are sometimes actually counterproductive.\n\nIn this session, Michael Boeke will be discussing user experience antipatterns - design conventions that appear to be good solutions at first, but actually end up hampering usability. We’ll look at a number of real life antipatterns collected from around the web, and explore some better approaches. Hopefully, we’ll all walk out with a few new items in our design toolkit, and an increased awareness (and wariness) of design conventions.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Michael Boeke",
    "Technology": "Design/UX",
    "URI": "/api/sessions.json/UX-Antipatterns-Hidden-User-Traps-in-Sites-and-Apps",
    "EventType": "Session",
    "Id": "0e0951d6-8db5-4192-9e9b-65c8ad261716",
    "SessionLookupId": "UX-Antipatterns-Hidden-User-Traps-in-Sites-and-Apps",
    "SpeakerURI": "/api/speakers.json/Michael-Boeke",
    "Start": "2014-01-09T16:00:00Z",
 	"End": "2014-01-09T17:00:00Z"
  },
  {
    "Title": "Vagrant, the ability to think about production deployments from day 1 of development",
    "Abstract": "Traditionally, developers would write their applications without any thoughtas to what system it was going to be deployed onin production. It was also very difficult for them to understand how their software would react when releasing itinto a production environment as they didn't really understand how that environment wasconfigured.\n\nWhat if there was a way that developers could create the scripts needed to install dependencies andget the software running as it is developed? Vagrant does exactly this, it is a tool to create and configure lightweight, reproducible, and portable development environments. In this session, I will show you how to create a development workflow that will allow developers to use Vagrant to create a real continuous delivery pipeline. This means understanding the environment needs as well as what is needed to run the software.\n\nIn this session I will demonstrate how to start with anASP.NET MVC application and have the ability to create an Ubuntu environment to run this in production as well as how to run the same application in a Windows environment. Iwill also show how we, at OpenTable, integrate Vagrant into our pipeline to allow us to create a good acceptance testing environment against known datasets rather than having brittle tests.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Paul Stack",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/Vagrant-the-ability-to-think-about-production-deployments-from-day-1-of-development",
    "EventType": "Session",
    "Id": "003c9e79-f97a-485f-813b-aa890b59d2c7",
    "SessionLookupId": "Vagrant-the-ability-to-think-about-production-deployments-from-day-1-of-development",
    "SpeakerURI": "/api/speakers.json/Paul-Stack",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Web Development with Python and Django -- FULL DAY",
    "Abstract": "Get up to speed on web development with Python, the language that\n\"fits your brain,\" and Django, the web framework \"for perfectionists\nwith deadlines.\"  We'll strengthen your Python muscles by guiding you\nthrough the construction of a full website using Django that includes\na contact form, CMS pages, user registration, and CRUD operations,\nplus jumping-off points for further exploration.\n\nAttendees should bring a laptop with Python (2.7 or 3.3) and Git\nalready installed.  Some previous Python experience will be helpful\nbut not required; newcomers to Python should plan to pair with a more\nexperienced Pythonista.\n\nSetup instructions and slides will be available at\nhttps://github.com/mpirnat/django-tutorial.",
    "Start": "2014-01-07T13:30:00Z",
    "End": "2014-01-07T22:30:00Z",
    "Difficulty": "Intermediate",
    "SpeakerName": "Mike Pirnat",
    "Technology": "Python",
    "URI": "/api/sessions.json/Web-Development-with-Python-and-Django--FULL-DAY",
    "EventType": "PreCompiler",
    "SecondarySpeakerName": "David Stanek",
    "Id": "9c34e67f-e307-4d0b-bf24-592b9350fe47",
    "SessionLookupId": "Web-Development-with-Python-and-Django--FULL-DAY",
    "SpeakerURI": "/api/speakers.json/Mike-Pirnat"
  },
  {
    "Title": "Web Security Audits: A Comprehensive Guide",
    "Abstract": "Do you have an application out in the wild? The bad news is that it's being constantly bombarded by robots, script kiddies, and potentially even skilled attackers every day. How do you know you are doing the right things to keep your business and your customers safe? \n\nFollow along with Aaron Bedra as he breaks down the common components of a security audit and learn how you can do these things on your own to help give you the edge over attackers and feel more confident in your applications.",
    "Difficulty": "Intermediate",
    "SpeakerName": "Aaron Bedra",
    "Technology": "Other",
    "URI": "/api/sessions.json/Web-Security-Audits-A-Comprehensive-Guide",
    "EventType": "Session",
    "Id": "85773813-7027-4ad2-8151-1e230923d869",
    "SessionLookupId": "Web-Security-Audits-A-Comprehensive-Guide",
    "SpeakerURI": "/api/speakers.json/Aaron-Bedra",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Welcome to the world of Sound",
    "Abstract": "Overtone is an open source audio environment designed to explore new musical ideas (powered by the supercollider). Overtone turns programmers in musicians, crafting their music through code. We also have some machines who try to match the humans in composing music through Overtone. In this session we will cover how to use Overtone, the more advanced features, building our own instruments and using them to build music. While also looking at some algorithms used by AIs to compose music. \nWelcome to the world of Sound.",
    "Difficulty": "Beginner",
    "SpeakerName": "Joseph Wilk",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Welcome-to-the-world-of-Sound",
    "EventType": "Session",
    "Id": "ed7616e7-74bb-492c-a261-d5ccdb882ef2",
    "SessionLookupId": "Welcome-to-the-world-of-Sound",
    "SpeakerURI": "/api/speakers.json/Joseph-Wilk",
    "Start": "2014-01-09T21:50:00Z",
 	"End": "2014-01-09T22:50:00Z"
  },
  {
    "Title": "What the Heck is Kanban?",
    "Abstract": "In this presentation we will get to know Kanban as a tool to manage software development.  The presentation will explain the basics of Kanban and touch on a few more advanced topics.  We will see how Kanban is not a one-size-fits-all methodology, but rather a dynamic tool which through continuous improvement evolves to fit the needs of the organization.  We will look at some real Kanban boards, see how they evolved over time and discuss rationale behind the board changes.  We will look at an example of mixing Kanban and Scrum.  We will discuss lessons learned from 3 years of using Kanban; what has worked and what not.  This session is suitable for anyone curious about Kanban or people wanting to get more out of their Agile teams.",
    "Difficulty": "Beginner",
    "SpeakerName": "Stan Jónsson",
    "Technology": "Development Methodologies",
    "URI": "/api/sessions.json/What-the-Heck-is-Kanban",
    "EventType": "Session",
    "Id": "901c11e3-7173-4f7d-b8bb-8daa62ef4692",
    "SessionLookupId": "What-the-Heck-is-Kanban",
    "SpeakerURI": "/api/speakers.json/Stan-Jónsson",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  },
  {
    "Title": "Windows Azure Mobile Services:  The Perfect Partner",
    "Abstract": "Building a robust, modern mobile application often requires a developer to not only focus on the front-end user experience, but also back-end services such as data storage, user authentication, and often push notification services.  This is often the tedious, less enjoyable aspect of building an application for many mobile application developers.  Windows Azure Mobile Services provides a scalable and easy-to-use “backend-as-a-service” for mobile applications.  In this session we’ll use Windows Azure Mobile Services to power a new Windows 8 application.  We’ll see how in just a few minutes we can have a ready-to-go application and service that provides scalable data storage, user authentication, push notification support, and value-add services.",
    "Difficulty": "Beginner",
    "SpeakerName": "Michael Collier",
    "Technology": "Windows / .NET",
    "URI": "/api/sessions.json/Windows-Azure-Mobile-Services--The-Perfect-Partner",
    "EventType": "Session",
    "Id": "812eeac7-e2b0-4476-b769-e4c5c12d6a5c",
    "SessionLookupId": "Windows-Azure-Mobile-Services--The-Perfect-Partner",
    "SpeakerURI": "/api/speakers.json/Michael-Collier",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "Windows to Web: Angular for XAML developers",
    "Abstract": "Familiar with Windows Phone, WinRT, Silverlight or WPF development using XAML? Intrigued by writing web applications but don’t know where to start? Angular is a leading-edge JavaScript framework for client-side web development that will feel familiar to XAML developers. In this session, we’ll get you started on the road to building web applications using AngularJS. Taking a simple XAML application using C# and turning it into a simple web application using parts of the AngularJS framework, we will see how concepts from one carry over to the other and begin to demystify the world of web apps. This is not about writing great HTML, CSS and JavaScript, this is about understanding where to begin.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jeff Yates",
    "Technology": "Cool Stuff",
    "URI": "/api/sessions.json/Windows-to-Web-Angular-for-XAML-developers",
    "EventType": "Session",
    "Id": "25c5a69a-d05b-43b3-beca-5157b35a03e7",
    "SessionLookupId": "Windows-to-Web-Angular-for-XAML-developers",
    "SpeakerURI": "/api/speakers.json/Jeff-Yates",
    "Start": "2014-01-09T18:45:00Z",
 	"End": "2014-01-09T19:45:00Z"
  },
  {
    "Title": "XCTest & Bots: CI with Xcode 5",
    "Abstract": "Xcode 5 comes with new features for testing and automation. This session will explore the new Test Navigator, how to use the new XCTest framework --the successor to OCUnit-- for unit testing your Objective-C code, and using OS X Server bots for continuous integration. First, we'll look at writing tests with XCTest. Then we'll cover setting up OS X Server to work with Xcode 5, configuring access to your repository, creating bots, and then monitoring your integrations.",
    "Difficulty": "Advanced",
    "SpeakerName": "Kevin Munc",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/XCTest--Bots-CI-with-Xcode-5",
    "EventType": "Session",
    "Id": "2ae81692-1608-41b9-ad52-6b8bff7d0f86",
    "SessionLookupId": "XCTest--Bots-CI-with-Xcode-5",
    "SpeakerURI": "/api/speakers.json/Kevin-Munc",
    "Start": "2014-01-10T20:35:00Z",
 	"End": "2014-01-10T21:35:00Z"
  },
  {
    "Title": "Your Graph is Showing: The Trend toward Graph Databases & Connected Data",
    "Abstract": "Developers have turned to NoSQL databases, such as MongoDB and Cassandra, to build social networks and online communities because of their relative speed and simplicity.  However, when creating connections, understanding trends and seeing commonalities within data, developers at places like Facebook and Twitter have increasingly turned to graph databases.\n\nIn this discussion, we'll start with a quick overview of the database landscape and how graph databases fit within it.  Next, we'll dive into neo4j, a popular graph database, and demonstrate how to solve complex, connected data problems with an in-depth look at examples demonstrating the power, speed and simplicity of using graph databases.  We'll close with a look at some caveats as well as glimpse into the future of graph databases.\n\n5 things to learn:\n\n1. What are graph databases? \n2. Why devs should care about graph databases vs. relational databases vs. other options\n3. When a graph database makes sense and when it doesn't\n4. Security & integration/implementation options with the neo4j graph database\n5. Caveats and the future of graph databases",
    "Difficulty": "Intermediate",
    "SpeakerName": "Greg Jordan",
    "Technology": "Other",
    "URI": "/api/sessions.json/Your-Graph-is-Showing-The-Trend-toward-Graph-Databases--Connected-Data",
    "EventType": "Session",
    "Id": "299270d9-7f9c-4d0c-8b78-f76525a7b071",
    "SessionLookupId": "Your-Graph-is-Showing-The-Trend-toward-Graph-Databases--Connected-Data",
    "SpeakerURI": "/api/speakers.json/Greg-Jordan",
    "Start": "2014-01-09T20:45:00Z",
 	"End": "2014-01-09T21:35:00Z"
  },
  {
    "Title": "Zen And The Intro To iOS Gesture Recognizers",
    "Abstract": "Gesture Recognizers are Apple's answer to the problem: How do I keep all those touches straight!?!? It's about tracking touch state over time, and UIGestureRecognizer subclasses give us a standard and composable way to manage that complexity. We'll look at how recognizers work, how they compete to decide which one \"wins\", see a custom complex gesture recognizer in action, and discuss how to leverage this in your applications. Slides, sample code, and fun will be provided. Bring your own Mac and Xcode.",
    "Difficulty": "Beginner",
    "SpeakerName": "Jonathan Penn",
    "Technology": "Mobile (Android, iOS, Windows Mobile, etc)",
    "URI": "/api/sessions.json/Zen-And-The-Intro-To-iOS-Gesture-Recognizers",
    "EventType": "Session",
    "Id": "7adb122a-5151-4af9-9a35-6636d4ecb223",
    "SessionLookupId": "Zen-And-The-Intro-To-iOS-Gesture-Recognizers",
    "SpeakerURI": "/api/speakers.json/Jonathan-Penn",
    "Start": "2014-01-10T15:45:00Z",
 	"End": "2014-01-10T16:45:00Z"
  }
]